{
  "connections": {
    "categories": [
      {
        "name": "أَعْضَاءُ الْجِسْمِ الْبَشَرِيِّ",
        "nameEn": "Human Body Parts",
        "color": "yellow",
        "items": [
          {
            "ar": "لِسَانًا",
            "en": "Tongue",
            "ref": "90:9",
            "verse": "وَلِسَانًۭا وَشَفَتَيْنِ",
            "verseEn": "And a tongue and two lips?"
          },
          {
            "ar": "أَعْيُنٍ",
            "en": "Eyes",
            "ref": "7:179",
            "verse": "وَلَقَدْ ذَرَأْنَا لِجَهَنَّمَ كَثِيرًۭا مِّنَ ٱلْجِنِّ وَٱلْإِنسِ ۖ لَهُمْ قُلُوبٌۭ لَّا يَفْقَهُونَ بِهَا وَلَهُمْ أَعْيُنٌۭ لَّا يُبْصِرُونَ بِهَا وَلَهُمْ ءَاذَانٌۭ لَّا يَسْمَعُونَ بِهَآ ۚ أُو۟لَـٰٓئِكَ كَٱلْأَنْعَـٰمِ بَلْ هُمْ أَضَلُّ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْغَـٰفِلُونَ",
            "verseEn": "And We have certainly created for Hell many of the jinn and mankind. They have hearts with which they do not understand, they have eyes with which they do not see, and they have ears with which they do not hear. Those are like livestock; rather, they are more astray. It is they who are the heedless."
          },
          {
            "ar": "آذَانِهِمْ",
            "en": "Their ears",
            "ref": "18:11",
            "verse": "فَضَرَبْنَا عَلَىٰٓ ءَاذَانِهِمْ فِى ٱلْكَهْفِ سِنِينَ عَدَدًۭا",
            "verseEn": "So We cast [a cover of sleep] over their ears within the cave for a number of years."
          },
          {
            "ar": "جُلُودُهُمْ",
            "en": "Their skins",
            "ref": "41:21",
            "verse": "وَقَالُوا۟ لِجُلُودِهِمْ لِمَ شَهِدتُّمْ عَلَيْنَا ۖ قَالُوٓا۟ أَنطَقَنَا ٱللَّهُ ٱلَّذِىٓ أَنطَقَ كُلَّ شَىْءٍۢ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍۢ وَإِلَيْهِ تُرْجَعُونَ",
            "verseEn": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allāh, who has made everything speak; and He created you the first time, and to Him you are returned."
          }
        ],
        "verse": {
          "ref": "16:78",
          "en": "And Allāh has extracted you from the wombs of your mothers not knowing a thing, and He made for you hearing and vision and hearts [i.e., intellect] that perhaps you would be grateful.",
          "ayah": "وَٱللَّهُ أَخْرَجَكُم مِّنۢ بُطُونِ أُمَّهَـٰتِكُمْ لَا تَعْلَمُونَ شَيْـًۭٔا وَجَعَلَ لَكُمُ ٱلسَّمْعَ وَٱلْأَبْصَـٰرَ وَٱلْأَفْـِٔدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ"
        }
      },
      {
        "name": "زِينَةُ أَهْلِ الْجَنَّةِ",
        "nameEn": "Adornments of the People of Paradise",
        "color": "green",
        "items": [
          {
            "ar": "أَسَاوِرَ",
            "en": "Bracelets",
            "ref": "22:23",
            "verse": "إِنَّ ٱللَّهَ يُدْخِلُ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍۢ وَلُؤْلُؤًۭا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌۭ",
            "verseEn": "Indeed, Allāh will admit those who believe and do righteous deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and pearl, and their garments therein will be silk."
          },
          {
            "ar": "لُؤْلُؤٌ",
            "en": "Pearls",
            "ref": "52:24",
            "verse": "۞ وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌۭ لَّهُمْ كَأَنَّهُمْ لُؤْلُؤٌۭ مَّكْنُونٌۭ",
            "verseEn": "There will circulate among them [servant] boys [especially] for them, as if they were pearls well-protected."
          },
          {
            "ar": "سُنْدُسٍ",
            "en": "Fine silk",
            "ref": "44:53",
            "verse": "يَلْبَسُونَ مِن سُندُسٍۢ وَإِسْتَبْرَقٍۢ مُّتَقَـٰبِلِينَ",
            "verseEn": "Wearing [garments of] fine silk and brocade, facing each other."
          },
          {
            "ar": "إِسْتَبْرَقٍ",
            "en": "Thick silk",
            "ref": "76:21",
            "verse": "عَـٰلِيَهُمْ ثِيَابُ سُندُسٍ خُضْرٌۭ وَإِسْتَبْرَقٌۭ ۖ وَحُلُّوٓا۟ أَسَاوِرَ مِن فِضَّةٍۢ وَسَقَىٰهُمْ رَبُّهُمْ شَرَابًۭا طَهُورًا",
            "verseEn": "Upon them [i.e., the inhabitants] will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink."
          }
        ],
        "verse": {
          "ref": "35:33",
          "en": "[For them are] gardens of perpetual residence which they will enter. They will be adorned therein with bracelets of gold and pearls, and their garments therein will be silk.",
          "ayah": "جَنَّـٰتُ عَدْنٍۢ يَدْخُلُونَهَا يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍۢ وَلُؤْلُؤًۭا ۖ وَلِبَاسُهُمْ فِيهَا حَرِيرٌۭ"
        }
      },
      {
        "name": "ظَوَاهِرُ جَوِّيَّةٌ وَطَبِيعِيَّةٌ",
        "nameEn": "Atmospheric and Natural Phenomena",
        "color": "blue",
        "items": [
          {
            "ar": "الْوَدْقَ",
            "en": "Raindrops",
            "ref": "24:43",
            "verse": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يُزْجِى سَحَابًۭا ثُمَّ يُؤَلِّفُ بَيْنَهُۥ ثُمَّ يَجْعَلُهُۥ رُكَامًۭا فَتَرَى ٱلْوَدْقَ يَخْرُجُ مِنْ خِلَـٰلِهِۦ وَيُنَزِّلُ مِنَ ٱلسَّمَآءِ مِن جِبَالٍۢ فِيهَا مِنۢ بَرَدٍۢ فَيُصِيبُ بِهِۦ مَن يَشَآءُ وَيَصْرِفُهُۥ عَن مَّن يَشَآءُ ۖ يَكَادُ سَنَا بَرْقِهِۦ يَذْهَبُ بِٱلْأَبْصَـٰرِ",
            "verseEn": "Do you not see that Allāh drives clouds? Then He brings them together; then He makes them into a mass, and you see the rain emerge from within it. And He sends down from the sky, mountains [of clouds] within which is hail, and He strikes with it whom He wills and averts it from whom He wills. The flash of its lightning almost takes away the eyesight."
          },
          {
            "ar": "الرَّعْدُ",
            "en": "Thunder",
            "ref": "13:13",
            "verse": "وَيُسَبِّحُ ٱلرَّعْدُ بِحَمْدِهِۦ وَٱلْمَلَـٰٓئِكَةُ مِنْ خِيفَتِهِۦ وَيُرْسِلُ ٱلصَّوَٰعِقَ فَيُصِيبُ بِهَا مَن يَشَآءُ وَهُمْ يُجَـٰدِلُونَ فِى ٱللَّهِ وَهُوَ شَدِيدُ ٱلْمِحَالِ",
            "verseEn": "And the thunder exalts [Allāh] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allāh; and He is severe in assault."
          },
          {
            "ar": "الظِّلَّ",
            "en": "The shadow",
            "ref": "25:45",
            "verse": "أَلَمْ تَرَ إِلَىٰ رَبِّكَ كَيْفَ مَدَّ ٱلظِّلَّ وَلَوْ شَآءَ لَجَعَلَهُۥ سَاكِنًۭا ثُمَّ جَعَلْنَا ٱلشَّمْسَ عَلَيْهِ دَلِيلًۭا",
            "verseEn": "Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication."
          },
          {
            "ar": "الرِّيَاحَ",
            "en": "The winds",
            "ref": "30:46",
            "verse": "وَمِنْ ءَايَـٰتِهِۦٓ أَن يُرْسِلَ ٱلرِّيَاحَ مُبَشِّرَٰتٍۢ وَلِيُذِيقَكُم مِّن رَّحْمَتِهِۦ وَلِتَجْرِىَ ٱلْفُلْكُ بِأَمْرِهِۦ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ وَلَعَلَّكُمْ تَشْكُرُونَ",
            "verseEn": "And of His signs is that He sends the winds as bringers of good tidings and to let you taste His mercy [i.e., rain] and so the ships may sail at His command and so you may seek of His bounty, and perhaps you will be grateful."
          }
        ],
        "verse": {
          "ref": "30:48",
          "en": "It is Allāh who sends the winds, and they stir the clouds and spread them in the sky however He wills, and He makes them fragments so you see the rain emerge from within them. And when He causes it to fall upon whom He wills of His servants, immediately they rejoice",
          "ayah": "ٱللَّهُ ٱلَّذِى يُرْسِلُ ٱلرِّيَـٰحَ فَتُثِيرُ سَحَابًۭا فَيَبْسُطُهُۥ فِى ٱلسَّمَآءِ كَيْفَ يَشَآءُ وَيَجْعَلُهُۥ كِسَفًۭا فَتَرَى ٱلْوَدْقَ يَخْرُجُ مِنْ خِلَـٰلِهِۦ ۖ فَإِذَآ أَصَابَ بِهِۦ مَن يَشَآءُ مِنْ عِبَادِهِۦٓ إِذَا هُمْ يَسْتَبْشِرُونَ"
        }
      },
      {
        "name": "أَنْوَاعُ الْأَوَانِي وَالْكُؤُوسِ",
        "nameEn": "Types of Vessels and Cups",
        "color": "purple",
        "items": [
          {
            "ar": "كَأْسٍ",
            "en": "Cup/Chalice",
            "ref": "56:18",
            "verse": "بِأَكْوَابٍۢ وَأَبَارِيقَ وَكَأْسٍۢ مِّن مَّعِينٍۢ",
            "verseEn": "With vessels, pitchers and a cup [of wine] from a flowing spring -"
          },
          {
            "ar": "وِعَاءِ",
            "en": "Bag/Container",
            "ref": "12:76",
            "verse": "فَبَدَأَ بِأَوْعِيَتِهِمْ قَبْلَ وِعَآءِ أَخِيهِ ثُمَّ ٱسْتَخْرَجَهَا مِن وِعَآءِ أَخِيهِ ۚ كَذَٰلِكَ كِدْنَا لِيُوسُفَ ۖ مَا كَانَ لِيَأْخُذَ أَخَاهُ فِى دِينِ ٱلْمَلِكِ إِلَّآ أَن يَشَآءَ ٱللَّهُ ۚ نَرْفَعُ دَرَجَـٰتٍۢ مَّن نَّشَآءُ ۗ وَفَوْقَ كُلِّ ذِى عِلْمٍ عَلِيمٌۭ",
            "verseEn": "So he began [the search] with their bags before the bag of his brother; then he extracted it from the bag of his brother. Thus did We plan for Joseph. He could not have taken his brother within the religion [i.e., law] of the king except that Allāh willed. We raise in degrees whom We will, but over every possessor of knowledge is one [more] knowing."
          },
          {
            "ar": "أَكْوَابٌ",
            "en": "Goblets",
            "ref": "88:14",
            "verse": "وَأَكْوَابٌۭ مَّوْضُوعَةٌۭ",
            "verseEn": "And cups put in place"
          },
          {
            "ar": "قَوَارِيرَا",
            "en": "Crystal vessels",
            "ref": "76:15",
            "verse": "وَيُطَافُ عَلَيْهِم بِـَٔانِيَةٍۢ مِّن فِضَّةٍۢ وَأَكْوَابٍۢ كَانَتْ قَوَارِيرَا۠",
            "verseEn": "And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],"
          }
        ],
        "verse": {
          "ref": "43:71",
          "en": "Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally.",
          "ayah": "يُطَافُ عَلَيْهِم بِصِحَافٍۢ مِّن ذَهَبٍۢ وَأَكْوَابٍۢ ۖ وَفِيهَا مَا تَشْتَهِيهِ ٱلْأَنفُسُ وَتَلَذُّ ٱلْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَـٰلِدُونَ"
        }
      }
    ]
  },
  "harf": {
    "word": "لسان",
    "display": "لِسَان",
    "hint": "This word means 'tongue' or 'language' and is used in the Quran to describe the clarity of the Arabic message.",
    "verseRef": "16:103",
    "arabicVerse": "وَلَقَدْ نَعْلَمُ أَنَّهُمْ يَقُولُونَ إِنَّمَا يُعَلِّمُهُۥ بَشَرٌۭ ۗ لِّسَانُ ٱلَّذِى يُلْحِدُونَ إِلَيْهِ أَعْجَمِىٌّۭ وَهَـٰذَا لِسَانٌ عَرَبِىٌّۭ مُّبِينٌ",
    "verse": "16:103 — And We certainly know that they say, \"It is only a human being who teaches him [i.e., the Prophet (ﷺ)].\" The tongue of the one they refer to is foreign, and this [recitation, i.e., Qur’ān] is [in] a clear Arabic language."
  },
  "deduction": {
    "title": "The Herald of the Great Deluge",
    "intro": "This individual stood as a pillar of endurance for centuries, calling a defiant society toward the light of truth while facing mockery and rejection. Despite the overwhelming odds and the weight of a message spanning generations, this servant remained steadfast in their mission until the final decree was issued.",
    "clues": [
      "I spent nine hundred and fifty years calling my people to the path of righteousness, day and night, in secret and in public.",
      "I warned my people of a painful punishment, yet they put their fingers in their ears and covered themselves with their garments in arrogance.",
      "I was commanded to build something massive under the watchful eyes of my Lord, even though there was no water in sight.",
      "As I worked, the leaders of my people passed by and mocked me, but I told them that soon we would be the ones mocking them.",
      "I pleaded for my own flesh and blood to join me, but they chose to seek refuge on a mountain, believing it would save them from the rising tide.",
      "My vessel eventually came to rest on Mount Judi after the earth swallowed its water and the sky ceased its downpour."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Prophet Hud",
          "Prophet Salih",
          "Prophet Nuh",
          "Prophet Lut",
          "Prophet Shu'ayb"
        ],
        "answer": "Prophet Nuh"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The Transforming Staff",
          "The Great Flood",
          "The Cooling Fire",
          "The Splitting Sea",
          "The Camel of God"
        ],
        "answer": "The Great Flood"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Golden Calf",
          "The Staff",
          "The Shirt",
          "The Ark",
          "The Ring"
        ],
        "answer": "The Ark"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Entering the Promised Land",
          "Drowning in the Red Sea",
          "Resting on Mount Judi",
          "Being thrown into a pit",
          "Ascending to the Heavens"
        ],
        "answer": "Resting on Mount Judi"
      }
    },
    "verseRef": "11:44",
    "arabic": "وَقِيلَ يَـٰٓأَرْضُ ٱبْلَعِى مَآءَكِ وَيَـٰسَمَآءُ أَقْلِعِى وَغِيضَ ٱلْمَآءُ وَقُضِىَ ٱلْأَمْرُ وَٱسْتَوَتْ عَلَى ٱلْجُودِىِّ ۖ وَقِيلَ بُعْدًۭا لِّلْقَوْمِ ٱلظَّـٰلِمِينَ",
    "verse": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and it [i.e., the ship] came to rest on the [mountain of] Jūdiyy. And it was said, \"Away with the wrongdoing people.\" (11:44)"
  },
  "scramble": {
    "verseRef": "6:162",
    "reference": "Al-An'am (6:162)",
    "segments": [
      "قُلْ إِنَّ",
      "صَلَاتِي وَنُسُكِي",
      "وَمَحْيَايَ وَمَمَاتِي",
      "لِلَّهِ",
      "رَبِّ الْعَالَمِينَ"
    ],
    "translations": [
      "Say Indeed",
      "my prayer and my rites of sacrifice",
      "and my living and my dying",
      "(are) for Allah Lord",
      "(of) the worlds"
    ],
    "hint": "A powerful declaration of total devotion and sincerity, stating that every aspect of a believer's life and death belongs solely to Allah.",
    "arabic": "قُلْ إِنَّ صَلَاتِى وَنُسُكِى وَمَحْيَاىَ وَمَمَاتِى لِلَّهِ رَبِّ ٱلْعَـٰلَمِينَ",
    "words": [
      "قُلْ إِنَّ",
      "صَلَاتِى وَنُسُكِى",
      "وَمَحْيَاىَ وَمَمَاتِى",
      "لِلَّهِ رَبِّ",
      "ٱلْعَـٰلَمِينَ"
    ],
    "verseEn": "Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allāh, Lord of the worlds."
  },
  "juz": {
    "date": "2026-02-21",
    "juz_number": 5,
    "juz_name": "Wal Muhsanat",
    "juz_name_ar": "وَالْمُحْصَنَاتُ",
    "verse": {
      "surah_number": 4,
      "surah_name": "An-Nisa",
      "surah_name_ar": "النساء",
      "ayah_number": 103,
      "arabic_text": "فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ قِيَامًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ فَإِذَا اطْمَأْنَنْتُمْ فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا",
      "translation": "Then when you have finished the prayer, remember Allah standing and sitting and [lying] on your sides. But when you are secure, establish [regular] prayer. Indeed, prayer has been decreed upon the believers a decree of specified times.",
      "audio_url": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/596.mp3"
    },
    "theme_question": {
      "correct": "The obligation of performing prayer at its prescribed times and remembering Allah in all states.",
      "options": [
        "The obligation of performing prayer at its prescribed times and remembering Allah in all states.",
        "The rules for seeking permission before entering homes.",
        "The virtues of giving charity in secret.",
        "The historical account of the Battle of Badr."
      ]
    },
    "surah_question": {
      "correct_surah": 4,
      "options": [
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النساء",
          "name_en": "The Women"
        },
        {
          "num": 5,
          "name": "Al-Ma'idah",
          "name_ar": "المائدة",
          "name_en": "The Table Spread"
        },
        {
          "num": 3,
          "name": "Al-Imran",
          "name_ar": "آل عمران",
          "name_en": "The Family of Imran"
        },
        {
          "num": 6,
          "name": "Al-An'am",
          "name_ar": "الأنعام",
          "name_en": "The Cattle"
        }
      ]
    },
    "surah_order": {
      "surahs": [
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النساء",
          "name_en": "The Women"
        }
      ]
    },
    "educational_notes": {
      "verse_context": "This verse occurs within the context of instructions for the 'Prayer of Fear' (Salat al-Khawf) during times of danger or battle. It emphasizes that even when the special fear prayer is completed, the remembrance of Allah should continue, and once security is restored, the full regular prayer must be established.",
      "theme_explanation": "The verse highlights two critical aspects of worship: constant dhikr (remembrance) and the discipline of salah. The phrase 'kitaban mawquta' signifying 'a decree of specified times' underscores that prayer is not just a general obligation but one tied to specific moments of the day, forming a spiritual rhythm for the believer.",
      "surah_overview": "Juz 5 is entirely contained within Surah An-Nisa. This section of the Surah continues to address themes of social justice, legal rulings concerning marriage and family, inheritance, and the rights of the vulnerable. It also addresses the complexities of dealing with hypocrites and provides guidance on maintaining faith during adversity."
    }
  }
}