{
  "connections": {
    "categories": [
      {
        "name": "سِجِلُّ الأَعْمَالِ",
        "nameEn": "Record of Deeds",
        "color": "yellow",
        "items": [
          {
            "ar": "كِتَابَهُ",
            "en": "his record",
            "ref": "84:7",
            "verse": "فَأَمَّا مَنْ أُوتِىَ كِتَـٰبَهُۥ بِيَمِينِهِۦ",
            "verseEn": "Then as for he who is given his record in his right hand,"
          },
          {
            "ar": "صُحُفُ",
            "en": "scrolls",
            "ref": "81:10",
            "verse": "وَإِذَا ٱلصُّحُفُ نُشِرَتْ",
            "verseEn": "And when the pages are spread [i.e., made public]"
          },
          {
            "ar": "الْمَوَازِينَ",
            "en": "the scales",
            "ref": "21:47",
            "verse": "وَنَضَعُ ٱلْمَوَٰزِينَ ٱلْقِسْطَ لِيَوْمِ ٱلْقِيَـٰمَةِ فَلَا تُظْلَمُ نَفْسٌۭ شَيْـًۭٔا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍۢ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَـٰسِبِينَ",
            "verseEn": "And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant."
          },
          {
            "ar": "الْأَلْوَاحِ",
            "en": "the tablets",
            "ref": "7:145",
            "verse": "وَكَتَبْنَا لَهُۥ فِى ٱلْأَلْوَاحِ مِن كُلِّ شَىْءٍۢ مَّوْعِظَةًۭ وَتَفْصِيلًۭا لِّكُلِّ شَىْءٍۢ فَخُذْهَا بِقُوَّةٍۢ وَأْمُرْ قَوْمَكَ يَأْخُذُوا۟ بِأَحْسَنِهَا ۚ سَأُو۟رِيكُمْ دَارَ ٱلْفَـٰسِقِينَ",
            "verseEn": "And We wrote for him on the tablets [something] of all things - instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\""
          }
        ],
        "verse": {
          "ref": "45:29",
          "en": "This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do.\"",
          "ayah": "هَـٰذَا كِتَـٰبُنَا يَنطِقُ عَلَيْكُم بِٱلْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنسِخُ مَا كُنتُمْ تَعْمَلُونَ"
        }
      },
      {
        "name": "نَبَاتَاتٌ مُنْتَفَعٌ بِهَا",
        "nameEn": "Beneficial Plants",
        "color": "green",
        "items": [
          {
            "ar": "زَرْعًا",
            "en": "crops",
            "ref": "32:27",
            "verse": "أَوَلَمْ يَرَوْا۟ أَنَّا نَسُوقُ ٱلْمَآءَ إِلَى ٱلْأَرْضِ ٱلْجُرُزِ فَنُخْرِجُ بِهِۦ زَرْعًۭا تَأْكُلُ مِنْهُ أَنْعَـٰمُهُمْ وَأَنفُسُهُمْ ۖ أَفَلَا يُبْصِرُونَ",
            "verseEn": "Have they not seen that We drive water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?"
          },
          {
            "ar": "قَضْبًا",
            "en": "fodder",
            "ref": "80:28",
            "verse": "وَعِنَبًۭا وَقَضْبًۭا",
            "verseEn": "And grapes and herbage"
          },
          {
            "ar": "الشَّجَرُ",
            "en": "the trees",
            "ref": "22:18",
            "verse": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يَسْجُدُ لَهُۥ مَن فِى ٱلسَّمَـٰوَٰتِ وَمَن فِى ٱلْأَرْضِ وَٱلشَّمْسُ وَٱلْقَمَرُ وَٱلنُّجُومُ وَٱلْجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٌۭ مِّنَ ٱلنَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ ٱلْعَذَابُ ۗ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكْرِمٍ ۚ إِنَّ ٱللَّهَ يَفْعَلُ مَا يَشَآءُ ۩",
            "verseEn": "Do you not see [i.e., know] that to Allāh prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allāh humiliates - for him there is no bestower of honor. Indeed, Allāh does what He wills."
          },
          {
            "ar": "النَّخْلَ",
            "en": "the date palms",
            "ref": "6:141",
            "verse": "۞ وَهُوَ ٱلَّذِىٓ أَنشَأَ جَنَّـٰتٍۢ مَّعْرُوشَـٰتٍۢ وَغَيْرَ مَعْرُوشَـٰتٍۢ وَٱلنَّخْلَ وَٱلزَّرْعَ مُخْتَلِفًا أُكُلُهُۥ وَٱلزَّيْتُونَ وَٱلرُّمَّانَ مُتَشَـٰبِهًۭا وَغَيْرَ مُتَشَـٰبِهٍۢ ۚ كُلُوا۟ مِن ثَمَرِهِۦٓ إِذَآ أَثْمَرَ وَءَاتُوا۟ حَقَّهُۥ يَوْمَ حَصَادِهِۦ ۖ وَلَا تُسْرِفُوٓا۟ ۚ إِنَّهُۥ لَا يُحِبُّ ٱلْمُسْرِفِينَ",
            "verseEn": "And He it is who causes gardens to grow, [both] trellised and untrellised, and palm trees and crops of different [kinds of] food and olives and pomegranates, similar and dissimilar. Eat of [each of] its fruit when it yields and give its due [zakāh] on the day of its harvest. And be not excessive. Indeed, He does not like those who commit excess."
          }
        ],
        "verse": {
          "ref": "20:53",
          "en": "[It is He] who has made for you the earth as a bed [spread out] and inserted therein for you roadways and sent down from the sky, rain and produced thereby categories of various plants.",
          "ayah": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ مَهْدًۭا وَسَلَكَ لَكُمْ فِيهَا سُبُلًۭا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجْنَا بِهِۦٓ أَزْوَٰجًۭا مِّن نَّبَاتٍۢ شَتَّىٰ"
        }
      },
      {
        "name": "أَنْوَاعُ الْاِبْتِلَاءِ",
        "nameEn": "Types of Trials",
        "color": "blue",
        "items": [
          {
            "ar": "فِتْنَةٌ",
            "en": "affliction",
            "ref": "2:193",
            "verse": "وَقَـٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌۭ وَيَكُونَ ٱلدِّينُ لِلَّهِ ۖ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ",
            "verseEn": "Fight them until there is no [more] fitnah and [until] religion [i.e., worship] is [acknowledged to be] for Allāh. But if they cease, then there is to be no aggression [i.e., assault] except against the oppressors."
          },
          {
            "ar": "بَلَاءٌ",
            "en": "a trial",
            "ref": "2:49",
            "verse": "وَإِذْ نَجَّيْنَـٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌۭ مِّن رَّبِّكُمْ عَظِيمٌۭ",
            "verseEn": "And [recall] when We saved you [i.e., your forefathers] from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord."
          },
          {
            "ar": "بِالسِّنِينَ",
            "en": "with years (of famine)",
            "ref": "7:130",
            "verse": "وَلَقَدْ أَخَذْنَآ ءَالَ فِرْعَوْنَ بِٱلسِّنِينَ وَنَقْصٍۢ مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمْ يَذَّكَّرُونَ",
            "verseEn": "And We certainly seized the people of Pharaoh with years of famine and a deficiency in fruits that perhaps they would be reminded."
          },
          {
            "ar": "الضُّرُّ",
            "en": "the adversity",
            "ref": "10:12",
            "verse": "وَإِذَا مَسَّ ٱلْإِنسَـٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦٓ أَوْ قَاعِدًا أَوْ قَآئِمًۭا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُۥ مَرَّ كَأَن لَّمْ يَدْعُنَآ إِلَىٰ ضُرٍّۢ مَّسَّهُۥ ۚ كَذَٰلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُوا۟ يَعْمَلُونَ",
            "verseEn": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing."
          }
        ],
        "verse": {
          "ref": "2:155",
          "en": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient,",
          "ayah": "وَلَنَبْلُوَنَّكُم بِشَىْءٍۢ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍۢ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ"
        }
      },
      {
        "name": "قُرْبٌ إِلَهِيٌّ وَوُصُولٌ",
        "nameEn": "Divine Proximity and Connection",
        "color": "purple",
        "items": [
          {
            "ar": "وَلِيُّ",
            "en": "the Protector",
            "ref": "2:257",
            "verse": "ٱللَّهُ وَلِىُّ ٱلَّذِينَ ءَامَنُوا۟ يُخْرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۖ وَٱلَّذِينَ كَفَرُوٓا۟ أَوْلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخْرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَـٰتِ ۗ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
            "verseEn": "Allāh is the Ally of those who believe. He brings them out from darknesses into the light. And those who disbelieve - their allies are ṭāghūt. They take them out of the light into darknesses. Those are the companions of the Fire; they will abide eternally therein."
          },
          {
            "ar": "قَرِيبٌ",
            "en": "near",
            "ref": "2:186",
            "verse": "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
            "verseEn": "And when My servants ask you, [O Muḥammad], concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided."
          },
          {
            "ar": "حَفِيًّا",
            "en": "gracious",
            "ref": "19:47",
            "verse": "قَالَ سَلَـٰمٌ عَلَيْكَ ۖ سَأَسْتَغْفِرُ لَكَ رَبِّىٓ ۖ إِنَّهُۥ كَانَ بِى حَفِيًّۭا",
            "verseEn": "[Abraham] said, \"Peace [i.e., safety] will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me."
          },
          {
            "ar": "أَوَّابٍ",
            "en": "oft-returning (to Allah)",
            "ref": "50:32",
            "verse": "هَـٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍۢ",
            "verseEn": "[It will be said], \"This is what you were promised - for every returner [to Allāh] and keeper [of His covenant]."
          }
        ],
        "verse": {
          "ref": "50:16",
          "en": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein.",
          "ayah": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ"
        }
      }
    ]
  },
  "harf": {
    "word": "علم",
    "display": "عِلْم",
    "hint": "What you seek when you say \"Rabbi zidni...\"",
    "verseRef": "20:114",
    "arabicVerse": "فَتَعَـٰلَى ٱللَّهُ ٱلْمَلِكُ ٱلْحَقُّ ۗ وَلَا تَعْجَلْ بِٱلْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ وَقُل رَّبِّ زِدْنِى عِلْمًۭا",
    "verse": "20:114 — So high [above all] is Allāh, the Sovereign, the Truth. And, [O Muḥammad], do not hasten with [recitation of] the Qur’ān before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\""
  },
  "deduction": {
    "title": "The Fire's Witness",
    "intro": "A profound individual, dedicated to uncovering the ultimate reality, embarked on a journey of spiritual discovery. Their unwavering conviction led them to challenge established norms, facing immense trials that tested the limits of faith. This soul's story is a testament to divine protection and guidance.",
    "clues": [
      "I was blessed with a unique title from my Lord, signifying a deep and special bond.",
      "My early life was spent among a people who bowed down to crafted images, but my heart yearned for the One True God.",
      "I observed the celestial bodies, the sun, moon, and stars, contemplating their rise and fall, concluding they could not be my Lord.",
      "In an act of defiance against widespread polytheism, I confronted the false deities, leaving a solitary, larger one intact as a silent accuser.",
      "My challenge to idolatry led to a severe punishment, as I was condemned to be cast into a raging inferno.",
      "Yet, by the command of my Creator, the intense flames transformed into a source of coolness and safety, preserving my life."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Prophet Musa",
          "Prophet Nuh",
          "Prophet Ibrahim",
          "Prophet Isa",
          "Prophet Yusuf"
        ],
        "answer": "Prophet Ibrahim"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "Crossing the Red Sea",
          "The Flood",
          "The Sacrifice of a Son",
          "The Fiery Ordeal",
          "The Whale's Belly"
        ],
        "answer": "The Fiery Ordeal"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Kaaba",
          "The Fire",
          "The Well"
        ],
        "answer": "The Fire"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Led people to safety",
          "Built a sacred house",
          "Was swallowed by a fish",
          "Was saved from burning",
          "Received the tablets"
        ],
        "answer": "Was saved from burning"
      }
    },
    "verseRef": "37:97",
    "arabic": "قَالُوا۟ ٱبْنُوا۟ لَهُۥ بُنْيَـٰنًۭا فَأَلْقُوهُ فِى ٱلْجَحِيمِ",
    "verse": "They said, \"Construct for him a structure [i.e., furnace] and throw him into the burning fire.\" (37:97)"
  },
  "scramble": {
    "verseRef": "8:24",
    "reference": "Al-Anfal (8:24)",
    "segments": [
      "يَا أَيُّهَا الَّذِينَ آمَنُوا",
      "اسْتَجِيبُوا لِلَّهِ",
      "وَلِلرَّسُولِ",
      "إِذَا دَعَاكُمْ",
      "لِمَا يُحْيِيكُمْ"
    ],
    "translations": [
      "O you who believe Respond",
      "to Allah and His Messenger when he calls you",
      "to what gives you life And know that",
      "Allah comes (in) between a man",
      "and his heart and that to Him you will be gathered"
    ],
    "hint": "This verse reminds believers to answer a divine call that brings true vitality and spiritual awakening.",
    "arabic": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَجِيبُوا۟ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ لِمَا يُحْيِيكُمْ ۖ وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ يَحُولُ بَيْنَ ٱلْمَرْءِ وَقَلْبِهِۦ وَأَنَّهُۥٓ إِلَيْهِ تُحْشَرُونَ",
    "words": [
      "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَجِيبُوا۟",
      "لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُمْ",
      "لِمَا يُحْيِيكُمْ ۖ وَٱعْلَمُوٓا۟ أَنَّ",
      "ٱللَّهَ يَحُولُ بَيْنَ ٱلْمَرْءِ",
      "وَقَلْبِهِۦ وَأَنَّهُۥٓ إِلَيْهِ تُحْشَرُونَ"
    ],
    "verseEn": "O you who have believed, respond to Allāh and to the Messenger when he calls you to that which gives you life. And know that Allāh intervenes between a man and his heart and that to Him you will be gathered."
  },
  "juz": {
    "date": "2026-02-20",
    "juz_number": 4,
    "juz_name": "Lan Tanālū",
    "juz_name_ar": "لَن تَنَالُوا",
    "verse": {
      "surah_number": 3,
      "surah_name": "Al-Imran",
      "surah_name_ar": "آل عمران",
      "ayah_number": 103,
      "arabic_text": "وَاعْتَصِمُوا بِحَبْلِ اللَّهِ جَمِيعًا وَلَا تَفَرَّقُوا ۚ وَاذْكُرُوا نِعْمَتَ اللَّهِ عَلَيْكُمْ إِذْ كُنتُمْ أَعْدَاءً فَأَلَّفَ بَيْنَ قُلُوبِكُمْ فَأَصْبَحْتُم بِنِعْمَتِهِ إِخْوَانًا وَكُنتُمْ عَلَىٰ شَفَا حُفْرَةٍ مِّنَ النَّارِ فَأَنقَذَكُم مِّنْهَا ۗ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَهْتَدُونَ",
      "translation": "And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.",
      "audio_url": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/396.mp3"
    },
    "theme_question": {
      "correct": "The paramount importance of unity among Muslims and adherence to Allah's guidance to avoid division.",
      "options": [
        "The paramount importance of unity among Muslims and adherence to Allah's guidance to avoid division.",
        "The necessity of individual worship and devotion as the sole path to salvation.",
        "The prohibition of innovation in religion and strict adherence to ancestral traditions.",
        "The rewards for those who struggle in Allah's cause through warfare and conquest."
      ]
    },
    "surah_question": {
      "correct_surah": 3,
      "options": [
        {
          "num": 3,
          "name": "Al-Imran",
          "name_ar": "آل عمران",
          "name_en": "The Family of Imran"
        },
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النساء",
          "name_en": "The Women"
        },
        {
          "num": 2,
          "name": "Al-Baqarah",
          "name_ar": "البقرة",
          "name_en": "The Cow"
        },
        {
          "num": 5,
          "name": "Al-Ma'idah",
          "name_ar": "المائدة",
          "name_en": "The Table Spread"
        }
      ]
    },
    "surah_order": {
      "surahs": [
        {
          "num": 3,
          "name": "Al-Imran",
          "name_ar": "آل عمران",
          "name_en": "The Family of Imran"
        },
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النساء",
          "name_en": "The Women"
        }
      ]
    },
    "educational_notes": {
      "verse_context": "This powerful verse from Surah Al-Imran comes after a series of warnings to the People of the Book about their divisions and their deviation from the true path. It directly addresses the Muslim community, urging them to learn from past mistakes and to safeguard their unity. It reminds them of Allah's immense favor in bringing their hearts together, transforming them from enemies into brothers, and saving them from the brink of Hellfire, implying that maintaining this unity is a continuous act of gratitude and a means of guidance.",
      "theme_explanation": "The 'rope of Allah' (حَبْلِ اللَّهِ) is widely interpreted by scholars as the Quran, the Sunnah of the Prophet Muhammad (peace be upon him), or the religion of Islam itself. Holding firmly to it collectively signifies the absolute necessity of adhering to the divine revelation and prophetic guidance as the foundational basis for Muslim unity. The verse explicitly forbids division (وَلَا تَفَرَّقُوا), highlighting that fragmentation and discord are antithetical to the spirit of Islam and detrimental to the strength and well-being of the Ummah. It emphasizes that true brotherhood and harmony are gifts from Allah, achieved by following His path, and are essential for collective success and salvation.",
      "surah_overview": "Juz 4 encompasses a significant portion of Surah Al-Imran (from ayah 93 to the end) and the beginning of Surah An-Nisa (up to ayah 23). \n\n**Surah Al-Imran (The Family of Imran)** is a Madani Surah, continuing many themes from Al-Baqarah. It focuses on the Oneness of Allah (Tawhid), refuting the claims of Christians and Jews regarding prophethood and the nature of God, and detailing the stories of prophets like Zakariya, Maryam, and Isa (Jesus). A major part of the Surah addresses the lessons from the Battle of Uhud, emphasizing the importance of patience, steadfastness, and reliance on Allah in times of adversity, and the need for unity within the Muslim community. It also lays down principles for inviting to good and forbidding evil. \n\n**Surah An-Nisa (The Women)** is also a Madani Surah and begins in this Juz. It is distinctive for its detailed legislation concerning women's rights, orphans, inheritance, marriage, family law, and social justice. The Surah emphasizes the importance of upholding the rights of the vulnerable in society and establishes clear guidelines for ethical conduct within the family and community. It also addresses issues of hypocrisy (munafiqeen) and the People of the Book, calling for justice and fairness in all dealings."
    }
  }
}