{
  "connections": {
    "categories": [
      {
        "name": "صِفَاتُ الْقُرْآنِ الذَّاتِيَّةُ",
        "nameEn": "Inherent Qualities of the Quran",
        "color": "yellow",
        "items": [
          {
            "ar": "بَصَائِرُ",
            "en": "Insights/Evidences",
            "ref": "7:203",
            "verse": "وَإِذَا لَمْ تَأْتِهِم بِـَٔايَةٍۢ قَالُوا۟ لَوْلَا ٱجْتَبَيْتَهَا ۚ قُلْ إِنَّمَآ أَتَّبِعُ مَا يُوحَىٰٓ إِلَىَّ مِن رَّبِّى ۚ هَـٰذَا بَصَآئِرُ مِن رَّبِّكُمْ وَهُدًۭى وَرَحْمَةٌۭ لِّقَوْمٍۢ يُؤْمِنُونَ",
            "verseEn": "And when you, [O Muḥammad], do not bring them a sign [i.e., miracle], they say, \"Why have you not contrived it?\" Say, \"I only follow what is revealed to me from my Lord. This [Qur’ān] is enlightenment from your Lord and guidance and mercy for a people who believe.\""
          },
          {
            "ar": "فُرْقَانًا",
            "en": "Criterion",
            "ref": "25:1",
            "verse": "تَبَارَكَ ٱلَّذِى نَزَّلَ ٱلْفُرْقَانَ عَلَىٰ عَبْدِهِۦ لِيَكُونَ لِلْعَـٰلَمِينَ نَذِيرًا",
            "verseEn": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -"
          },
          {
            "ar": "شِفَاءٌ",
            "en": "Healing",
            "ref": "17:82",
            "verse": "وَنُنَزِّلُ مِنَ ٱلْقُرْءَانِ مَا هُوَ شِفَآءٌۭ وَرَحْمَةٌۭ لِّلْمُؤْمِنِينَ ۙ وَلَا يَزِيدُ ٱلظَّـٰلِمِينَ إِلَّا خَسَارًۭا",
            "verseEn": "And We send down of the Qur’ān that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss."
          },
          {
            "ar": "ذِكْرٌ",
            "en": "Reminder",
            "ref": "15:9",
            "verse": "إِنَّا نَحْنُ نَزَّلْنَا ٱلذِّكْرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ",
            "verseEn": "Indeed, it is We who sent down the message [i.e., the Qur’ān], and indeed, We will be its guardian."
          }
        ],
        "verse": {
          "ref": "39:23",
          "en": "Allāh has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance [i.e., mention] of Allāh. That is the guidance of Allāh by which He guides whom He wills. And one whom Allāh sends astray - for him there is no guide.",
          "ayah": "ٱللَّهُ نَزَّلَ أَحْسَنَ ٱلْحَدِيثِ كِتَـٰبًۭا مُّتَشَـٰبِهًۭا مَّثَانِىَ تَقْشَعِرُّ مِنْهُ جُلُودُ ٱلَّذِينَ يَخْشَوْنَ رَبَّهُمْ ثُمَّ تَلِينُ جُلُودُهُمْ وَقُلُوبُهُمْ إِلَىٰ ذِكْرِ ٱللَّهِ ۚ ذَٰلِكَ هُدَى ٱللَّهِ يَهْدِى بِهِۦ مَن يَشَآءُ ۚ وَمَن يُضْلِلِ ٱللَّهُ فَمَا لَهُۥ مِنْ هَادٍ"
        }
      },
      {
        "name": "أَحْوَالٌ نَفْسِيَّةٌ وَبَشَرِيَّةٌ",
        "nameEn": "Psychological and Human States",
        "color": "green",
        "items": [
          {
            "ar": "خَوْفٌ",
            "en": "Fear",
            "ref": "2:38",
            "verse": "قُلْنَا ٱهْبِطُوا۟ مِنْهَا جَمِيعًۭا ۖ فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًۭى فَمَن تَبِعَ هُدَاىَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ",
            "verseEn": "We said, \"Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve."
          },
          {
            "ar": "ضَيْقٍ",
            "en": "Distress",
            "ref": "16:127",
            "verse": "وَٱصْبِرْ وَمَا صَبْرُكَ إِلَّا بِٱللَّهِ ۚ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِى ضَيْقٍۢ مِّمَّا يَمْكُرُونَ",
            "verseEn": "And be patient, [O Muḥammad], and your patience is not but through Allāh. And do not grieve over them and do not be in distress over what they conspire."
          },
          {
            "ar": "غَضَبٌ",
            "en": "Anger",
            "ref": "20:86",
            "verse": "فَرَجَعَ مُوسَىٰٓ إِلَىٰ قَوْمِهِۦ غَضْبَـٰنَ أَسِفًۭا ۚ قَالَ يَـٰقَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا ۚ أَفَطَالَ عَلَيْكُمُ ٱلْعَهْدُ أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌۭ مِّن رَّبِّكُمْ فَأَخْلَفْتُم مَّوْعِدِى",
            "verseEn": "So Moses returned to his people, angry and grieved. He said, \"O my people, did your Lord not make you a good promise? Then, was the time [of its fulfillment] too long for you, or did you wish that wrath from your Lord descend upon you, so you broke your promise [of obedience] to me?\""
          },
          {
            "ar": "حُزْنٌ",
            "en": "Grief/Sadness",
            "ref": "12:84",
            "verse": "وَتَوَلَّىٰ عَنْهُمْ وَقَالَ يَـٰٓأَسَفَىٰ عَلَىٰ يُوسُفَ وَٱبْيَضَّتْ عَيْنَاهُ مِنَ ٱلْحُزْنِ فَهُوَ كَظِيمٌۭ",
            "verseEn": "And he turned away from them and said, \"Oh, my sorrow over Joseph,\" and his eyes became white from grief, for he was [of that] a suppressor."
          }
        ],
        "verse": {
          "ref": "10:62",
          "en": "Unquestionably, [for] the allies of Allāh there will be no fear concerning them, nor will they grieve -",
          "ayah": "أَلَآ إِنَّ أَوْلِيَآءَ ٱللَّهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُونَ"
        }
      },
      {
        "name": "مَفَاهِيمُ الْقَضَاءِ وَالْقَدَرِ",
        "nameEn": "Concepts of Divine Decree and Ordainment",
        "color": "blue",
        "items": [
          {
            "ar": "قَدَرًا",
            "en": "A measure/destiny",
            "ref": "54:49",
            "verse": "إِنَّا كُلَّ شَىْءٍ خَلَقْنَـٰهُ بِقَدَرٍۢ",
            "verseEn": "Indeed, all things We created with predestination."
          },
          {
            "ar": "أَجَلٌ",
            "en": "An appointed term",
            "ref": "7:34",
            "verse": "وَلِكُلِّ أُمَّةٍ أَجَلٌۭ ۖ فَإِذَا جَآءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةًۭ ۖ وَلَا يَسْتَقْدِمُونَ",
            "verseEn": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it]."
          },
          {
            "ar": "كُتِبَ",
            "en": "It was prescribed/decreed",
            "ref": "2:216",
            "verse": "كُتِبَ عَلَيْكُمُ ٱلْقِتَالُ وَهُوَ كُرْهٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تَكْرَهُوا۟ شَيْـًۭٔا وَهُوَ خَيْرٌۭ لَّكُمْ ۖ وَعَسَىٰٓ أَن تُحِبُّوا۟ شَيْـًۭٔا وَهُوَ شَرٌّۭ لَّكُمْ ۗ وَٱللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ",
            "verseEn": "Battle has been enjoined upon you while it is hateful to you. But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allāh knows, while you know not."
          },
          {
            "ar": "أَمْرًا",
            "en": "A matter/decree",
            "ref": "19:21",
            "verse": "قَالَ كَذَٰلِكِ قَالَ رَبُّكِ هُوَ عَلَىَّ هَيِّنٌۭ ۖ وَلِنَجْعَلَهُۥٓ ءَايَةًۭ لِّلنَّاسِ وَرَحْمَةًۭ مِّنَّا ۚ وَكَانَ أَمْرًۭا مَّقْضِيًّۭا",
            "verseEn": "He said, \"Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.'\""
          }
        ],
        "verse": {
          "ref": "33:38",
          "en": "There is not to be upon the Prophet any discomfort concerning that which Allāh has imposed upon him. [This is] the established way of Allāh with those [prophets] who have passed on before. And ever is the command of Allāh a destiny decreed.",
          "ayah": "مَّا كَانَ عَلَى ٱلنَّبِىِّ مِنْ حَرَجٍۢ فِيمَا فَرَضَ ٱللَّهُ لَهُۥ ۖ سُنَّةَ ٱللَّهِ فِى ٱلَّذِينَ خَلَوْا۟ مِن قَبْلُ ۚ وَكَانَ أَمْرُ ٱللَّهِ قَدَرًۭا مَّقْدُورًا"
        }
      },
      {
        "name": "مَعَالِمُ سَطْحِ الْأَرْضِ",
        "nameEn": "Features of the Earth's Surface",
        "color": "purple",
        "items": [
          {
            "ar": "الْجِبَالَ",
            "en": "The mountains",
            "ref": "79:32",
            "verse": "وَٱلْجِبَالَ أَرْسَىٰهَا",
            "verseEn": "And the mountains He set firmly"
          },
          {
            "ar": "أَنْهَارًا",
            "en": "Rivers",
            "ref": "16:15",
            "verse": "وَأَلْقَىٰ فِى ٱلْأَرْضِ رَوَٰسِىَ أَن تَمِيدَ بِكُمْ وَأَنْهَـٰرًۭا وَسُبُلًۭا لَّعَلَّكُمْ تَهْتَدُونَ",
            "verseEn": "And He has cast into the earth firmly set mountains, lest it shift with you, and [made] rivers and roads, that you may be guided,"
          },
          {
            "ar": "فِجَاجًا",
            "en": "Passages/Valleys",
            "ref": "21:31",
            "verse": "وَجَعَلْنَا فِى ٱلْأَرْضِ رَوَٰسِىَ أَن تَمِيدَ بِهِمْ وَجَعَلْنَا فِيهَا فِجَاجًۭا سُبُلًۭا لَّعَلَّهُمْ يَهْتَدُونَ",
            "verseEn": "And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided."
          },
          {
            "ar": "بُيُوتًا",
            "en": "Houses/Dwellings",
            "ref": "7:74",
            "verse": "وَٱذْكُرُوٓا۟ إِذْ جَعَلَكُمْ خُلَفَآءَ مِنۢ بَعْدِ عَادٍۢ وَبَوَّأَكُمْ فِى ٱلْأَرْضِ تَتَّخِذُونَ مِن سُهُولِهَا قُصُورًۭا وَتَنْحِتُونَ ٱلْجِبَالَ بُيُوتًۭا ۖ فَٱذْكُرُوٓا۟ ءَالَآءَ ٱللَّهِ وَلَا تَعْثَوْا۟ فِى ٱلْأَرْضِ مُفْسِدِينَ",
            "verseEn": "And remember when He made you successors after the ʿAad and settled you in the land, [and] you take for yourselves palaces from its plains and carve from the mountains, homes. Then remember the favors of Allāh and do not commit abuse on the earth, spreading corruption.\""
          }
        ],
        "verse": {
          "ref": "15:19",
          "en": "And the earth - We have spread it and cast therein firmly set mountains and caused to grow therein [something] of every well-balanced thing.",
          "ayah": "وَٱلْأَرْضَ مَدَدْنَـٰهَا وَأَلْقَيْنَا فِيهَا رَوَٰسِىَ وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍۢ مَّوْزُونٍۢ"
        }
      }
    ]
  },
  "harf": {
    "word": "رزق",
    "display": "رِزْق",
    "hint": "What Allah provides for sustenance and livelihood.",
    "verseRef": "7:32",
    "arabicVerse": "قُلْ مَنْ حَرَّمَ زِينَةَ ٱللَّهِ ٱلَّتِىٓ أَخْرَجَ لِعِبَادِهِۦ وَٱلطَّيِّبَـٰتِ مِنَ ٱلرِّزْقِ ۚ قُلْ هِىَ لِلَّذِينَ ءَامَنُوا۟ فِى ٱلْحَيَوٰةِ ٱلدُّنْيَا خَالِصَةًۭ يَوْمَ ٱلْقِيَـٰمَةِ ۗ كَذَٰلِكَ نُفَصِّلُ ٱلْـَٔايَـٰتِ لِقَوْمٍۢ يَعْلَمُونَ",
    "verse": "7:32 — Say, \"Who has forbidden the adornment of [i.e., from] Allāh which He has produced for His servants and the good [lawful] things of provision?\" Say, \"They are for those who believed during the life of this world, exclusively [for them] on the Day of Resurrection.\" Thus do We detail the verses for a people who know."
  },
  "deduction": {
    "title": "The Steadfast Witness",
    "intro": "A profound narrative unfolds, revealing the unwavering resolve of a community in the face of immense tyranny. Their story serves as a testament to faith, even when confronted with the ultimate sacrifice. This account reminds us of the power of belief against overwhelming oppression.",
    "clues": [
      "We were a group whose story is recounted in a short, powerful surah, warning against persecution.",
      "We faced a ruler who wished to eradicate our belief in the One God, the Lord of the Throne, the Praiseworthy.",
      "We were subjected to a terrible test involving a massive pit dug into the earth.",
      "We watched as believers, including infants, were cast into a raging inferno within that pit.",
      "Our tormentors were cursed for their actions, while we were promised immense reward for our steadfastness.",
      "The ruler's attempt to extinguish our faith only solidified our place as martyrs in the sight of Allah, who is witness to all things."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "People of Thamud",
          "People of 'Ad",
          "People of the Ditch",
          "People of Lut",
          "People of the Elephant"
        ],
        "answer": "People of the Ditch"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The Great Flood",
          "The Burning Bush",
          "The Drowning in the Sea",
          "The Fiery Pit",
          "The Earthquake"
        ],
        "answer": "The Fiery Pit"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Ditch",
          "The Mountain",
          "The Well"
        ],
        "answer": "The Ditch"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Were granted a kingdom",
          "Were saved by a miracle",
          "Achieved martyrdom and Paradise",
          "Were scattered across lands",
          "Were given immense wealth"
        ],
        "answer": "Achieved martyrdom and Paradise"
      }
    },
    "verseRef": "85:8",
    "arabic": "وَمَا نَقَمُوا۟ مِنْهُمْ إِلَّآ أَن يُؤْمِنُوا۟ بِٱللَّهِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
    "verse": "And they resented them not except because they believed in Allāh, the Exalted in Might, the Praiseworthy, (85:8)"
  },
  "scramble": {
    "verseRef": "49:10",
    "reference": "Surah Al-Hujurat (49:10)",
    "segments": [
      "إِنَّمَا الْمُؤْمِنُونَ",
      "إِخْوَةٌ",
      "فَأَصْلِحُوا بَيْنَ",
      "أَخَوَيْكُمْ ۚ",
      "وَاتَّقُوا اللَّهَ",
      "لَعَلَّكُمْ تُرْحَمُونَ"
    ],
    "translations": [
      "Only the believers",
      "(are) brothers so make peace",
      "between your brothers",
      "and fear Allah and fear Allah",
      "so that you may",
      "receive mercy"
    ],
    "hint": "This verse emphasizes the spiritual bond among Muslims and the importance of resolving conflicts, connecting it to piety and divine compassion.",
    "arabic": "إِنَّمَا ٱلْمُؤْمِنُونَ إِخْوَةٌۭ فَأَصْلِحُوا۟ بَيْنَ أَخَوَيْكُمْ ۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمْ تُرْحَمُونَ",
    "words": [
      "إِنَّمَا ٱلْمُؤْمِنُونَ",
      "إِخْوَةٌۭ فَأَصْلِحُوا۟",
      "بَيْنَ أَخَوَيْكُمْ ۚ",
      "وَٱتَّقُوا۟ ٱللَّهَ",
      "لَعَلَّكُمْ",
      "تُرْحَمُونَ"
    ],
    "verseEn": "The believers are but brothers, so make settlement between your brothers. And fear Allāh that you may receive mercy."
  },
  "juz": {
    "date": "2026-02-18",
    "juz_number": 2,
    "juz_name": "Sayaqool",
    "juz_name_ar": "سَيَقُولُ",
    "verse": {
      "surah_number": 2,
      "surah_name": "Al-Baqarah",
      "surah_name_ar": "البقرة",
      "ayah_number": 183,
      "arabic_text": "يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ",
      "translation": "O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous.",
      "audio_url": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/190.mp3"
    },
    "theme_question": {
      "correct": "The divine command for fasting to achieve piety (Taqwa).",
      "options": [
        "The importance of prayer and charity in Islam.",
        "The divine command for fasting to achieve piety (Taqwa).",
        "The history of prophets and their struggles.",
        "The benefits of seeking knowledge and wisdom."
      ]
    },
    "surah_question": {
      "correct_surah": 2,
      "options": [
        {
          "num": 2,
          "name": "Al-Baqarah",
          "name_ar": "البقرة",
          "name_en": "The Cow"
        },
        {
          "num": 1,
          "name": "Al-Fatihah",
          "name_ar": "الفاتحة",
          "name_en": "The Opening"
        },
        {
          "num": 3,
          "name": "Al-Imran",
          "name_ar": "آل عمران",
          "name_en": "The Family of Imran"
        },
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النساء",
          "name_en": "The Women"
        }
      ]
    },
    "surah_order": {
      "surahs": [
        {
          "num": 2,
          "name": "Al-Baqarah",
          "name_ar": "البقرة",
          "name_en": "The Cow"
        }
      ]
    },
    "educational_notes": {
      "verse_context": "This verse marks the divine commandment for Muslims to fast during the month of Ramadan. It appears within a section of Surah Al-Baqarah that outlines various laws and regulations for the nascent Muslim community in Madinah, following discussions on the change of Qibla and preceding detailed rules about fasting, including exemptions, compensation, and the importance of supplicating during this sacred month. It emphasizes the continuity of this spiritual practice across previous nations, connecting the Muslim Ummah to a universal tradition of devotion.",
      "theme_explanation": "The central theme of this verse is the obligation of fasting (Sawm) for believers and its profound spiritual purpose. By stating that fasting was 'decreed upon you as it was decreed upon those before you,' Allah (SWT) highlights the universal wisdom and timeless nature of this act of worship. The ultimate goal, 'that you may become righteous' (لَعَلَّكُمْ تَتَّقُونَ), underscores that fasting is not merely abstaining from food and drink, but a means to cultivate Taqwa – God-consciousness, piety, and self-restraint, leading to a deeper connection with Allah and a more virtuous life.",
      "surah_overview": "Al-Baqarah (The Cow) is the longest surah in the Quran, comprising 286 verses, and was primarily revealed in Madinah. It serves as a foundational guide for the Muslim community, covering a vast array of topics essential for establishing an Islamic society. Juz 2 specifically encompasses verses 142-252 of Surah Al-Baqarah. This section addresses critical issues such as the change of Qibla (direction of prayer) from Jerusalem to Makkah, establishing a distinct identity for the Muslim Ummah. It also lays down fundamental laws regarding fasting (Sawm) during Ramadan, the pilgrimage (Hajj), financial dealings (prohibition of interest, encouragement of charity), marriage, divorce, and the prohibition of alcohol and gambling. The Juz also includes narratives of prophets like Musa (AS) and the Children of Israel, offering lessons from past communities for the guidance of the believers."
    }
  }
}