{
  "connections": {
    "categories": [
      {
        "name": "مَرَاحِلُ خَلْقِ الْإِنْسَانِ",
        "nameEn": "Stages of Human Creation",
        "color": "yellow",
        "items": [
          {
            "ar": "تُرَابٍ",
            "en": "Dust",
            "verse": "إِنَّ مَثَلَ عِيسَىٰ عِنْدَ اللَّهِ كَمَثَلِ آدَمَ ۖ خَلَقَهُ مِنْ تُرَابٍ ثُمَّ قَالَ لَهُ كُنْ فَيَكُونُ",
            "ref": "3:59",
            "verseEn": ""
          },
          {
            "ar": "نُّطْفَةٍ",
            "en": "Sperm-drop",
            "verse": "خَلَقَ الْإِنْسَانَ مِنْ نُطْفَةٍ فَإِذَا هُوَ خَصِيمٌ مُبِينٌ",
            "ref": "16:4",
            "verseEn": ""
          },
          {
            "ar": "عَلَقَةٍ",
            "en": "Clot",
            "verse": "يَا أَيُّهَا النَّاسُ إِنْ كُنْتُمْ فِي رَيْبٍ مِنَ الْبَعْثِ فَإِنَّا خَلَقْنَاكُمْ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُضْغَةٍ مُخَلَّقَةٍ وَغَيْرِ مُخَلَّقَةٍ لِنُبَيِّنَ لَكُمْ ۚ وَنُقِرُّ فِي الْأَرْحَامِ مَا نَشَاءُ إِلَىٰ أَجَلٍ مُسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوا أَشُدَّكُمْ ۖ وَمِنْكُمْ مَنْ يُتَوَفَّىٰ وَمِنْكُمْ مَنْ يُرَدُّ إِلَىٰ أَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْ بَعْدِ عِلْمٍ شَيْئًا ۚ وَتَرَى الْأَرْضَ هَامِدَةً فَإِذَا أَنْزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ وَأَنْبَتَتْ مِنْ كُلِّ زَوْجٍ بَهِيجٍ",
            "ref": "22:5",
            "verseEn": ""
          },
          {
            "ar": "مُضْغَةً",
            "en": "Lump of Flesh",
            "verse": "ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظَامًا فَكَسَوْنَا الْعِظَامَ لَحْمًا ثُمَّ أَنْشَأْنَاهُ خَلْقًا آخَرَ ۚ فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
            "ref": "23:14",
            "verseEn": ""
          }
        ],
        "verse": {
          "ayah": "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ مِنْ سُلَالَةٍ مِنْ طِينٍ",
          "en": "And certainly did We create man from an extract of clay.",
          "ref": "23:12"
        }
      },
      {
        "name": "أَنْوَاعُ الْقَوْلِ",
        "nameEn": "Types of Speech/Utterances",
        "color": "green",
        "items": [
          {
            "ar": "كَلِمَةً طَيِّبَةً",
            "en": "A Good Word",
            "verse": "أَلَمْ تَرَ كَيْفَ ضَرَبَ اللَّهُ مَثَلًا كَلِمَةً طَيِّبَةً كَشَجَرَةٍ طَيِّبَةٍ أَصْلُهَا ثَابِتٌ وَفَرْعُهَا فِي السَّمَاءِ",
            "ref": "14:24",
            "verseEn": ""
          },
          {
            "ar": "كَلِمَةٍ خَبِيثَةٍ",
            "en": "An Evil Word",
            "verse": "وَمَثَلُ كَلِمَةٍ خَبِيثَةٍ كَشَجَرَةٍ خَبِيثَةٍ اجْتُثَّتْ مِنْ فَوْقِ الْأَرْضِ مَا لَهَا مِنْ قَرَارٍ",
            "ref": "14:26",
            "verseEn": ""
          },
          {
            "ar": "الْحَقُّ",
            "en": "The Truth",
            "verse": "وَقُلِ الْحَقُّ مِنْ رَبِّكُمْ ۖ فَمَنْ شَاءَ فَلْيُؤْمِنْ وَمَنْ شَاءَ فَلْيَكْفُرْ ۚ إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ ۚ بِئْسَ الشَّرَابُ وَسَاءَتْ مُرْتَفَقًا",
            "ref": "18:29",
            "verseEn": ""
          },
          {
            "ar": "قَوْلَ الزُّورِ",
            "en": "Falsehood/False Statement",
            "verse": "ذَٰلِكَ وَمَنْ يُعَظِّمْ حُرُمَاتِ اللَّهِ فَهُوَ خَيْرٌ لَهُ عِنْدَ رَبِّهِ ۗ وَأُحِلَّتْ لَكُمُ الْأَنْعَامُ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْأَوْثَانِ وَاجْتَنِبُوا قَوْلَ الزُّورِ",
            "ref": "22:30",
            "verseEn": ""
          }
        ],
        "verse": {
          "ayah": "يَسْتَخْفُونَ مِنَ النَّاسِ وَلَا يَسْتَخْفُونَ مِنَ اللَّهِ وَهُوَ مَعَهُمْ إِذْ يُبَيِّتُونَ مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ ۚ وَكَانَ اللَّهُ بِمَا يَعْمَلُونَ مُحِيطًا",
          "en": "They conceal [their evil intentions and deeds] from the people, but they cannot conceal them from Allah, and He is with them when they plot by night that which is not pleasing to [Him] in speech. And ever is Allah, of what they do, encompassing.",
          "ref": "4:108"
        }
      },
      {
        "name": "أَنْوَاعُ الْعُهُودِ وَالْأَيْمَانِ",
        "nameEn": "Types of Covenants and Oaths",
        "color": "blue",
        "items": [
          {
            "ar": "عَهْدِ اللَّهِ",
            "en": "Covenant of Allah",
            "verse": "وَأَوْفُوا بِعَهْدِ اللَّهِ إِذَا عَاهَدْتُمْ وَلَا تَنْقُضُوا الْأَيْمَانَ بَعْدَ تَوْكِيدِهَا وَقَدْ جَعَلْتُمُ اللَّهَ عَلَيْكُمْ كَفِيلًا ۚ إِنَّ اللَّهَ يَعْلَمُ مَا تَفْعَلُونَ",
            "ref": "16:91",
            "verseEn": ""
          },
          {
            "ar": "مِيثَاقًا غَلِيظًا",
            "en": "Solemn Covenant",
            "verse": "وَكَيْفَ تَأْخُذُونَهُ وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ وَأَخَذْنَ مِنْكُمْ مِيثَاقًا غَلِيظًا",
            "ref": "4:21",
            "verseEn": ""
          },
          {
            "ar": "أَيْمَانِكُمْ",
            "en": "Your Oaths",
            "verse": "لَا يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِي أَيْمَانِكُمْ وَلَٰكِنْ يُؤَاخِذُكُمْ بِمَا عَقَّدْتُمُ الْأَيْمَانَ ۚ فَكَفَّارَتُهُ إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ أَوْ تَحْرِيرُ رَقَبَةٍ ۖ فَمَنْ لَمْ يَجِدْ فَصِيَامُ ثَلَاثَةِ أَيَّامٍ ۚ ذَٰلِكَ كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ ۚ وَاحْفَظُوا أَيْمَانَكُمْ ۚ كَذَٰلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَشْكُرُونَ",
            "ref": "5:89",
            "verseEn": ""
          },
          {
            "ar": "أُقْسِمُ",
            "en": "I Swear",
            "verse": "لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ",
            "ref": "75:1",
            "verseEn": ""
          }
        ],
        "verse": {
          "ayah": "يَا أَيُّهَا الَّذِينَ آمَنُوا أَوْفُوا بِالْعُقُودِ ۚ أُحِلَّتْ لَكُمْ بَهِيمَةُ الْأَنْعَامِ إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ غَيْرَ مُحِلِّي الصَّيْدِ وَأَنْتُمْ حُرُمٌ ۗ إِنَّ اللَّهَ يَحْكُمُ مَا يُرِيدُ",
          "en": "O you who have believed, fulfill [all] contracts. Lawful for you are the animals of grazing livestock, except for what is recited to you, other than game prohibited while you are in iḥrām. Indeed, Allah ordains what He intends.",
          "ref": "5:1"
        }
      },
      {
        "name": "مَعَانِي الْفَتْحِ",
        "nameEn": "Meanings of 'Opening' (F-T-H)",
        "color": "purple",
        "items": [
          {
            "ar": "بَابًا",
            "en": "A Door",
            "verse": "وَلَوْ فَتَحْنَا عَلَيْهِمْ بَابًا مِنَ السَّمَاءِ فَظَلُّوا فِيهِ يَعْرُجُونَ",
            "ref": "15:14",
            "verseEn": ""
          },
          {
            "ar": "فَتْحًا",
            "en": "Victory/Conquest",
            "verse": "إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا",
            "ref": "48:1",
            "verseEn": ""
          },
          {
            "ar": "فَتَحَ اللَّهُ",
            "en": "Allah has Revealed/Opened",
            "verse": "وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَا بَعْضُهُمْ إِلَىٰ بَعْضٍ قَالُوا أَتُحَدِّثُونَهُمْ بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ لِيُحَاجُّوكُمْ بِهِ عِنْدَ رَبِّكُمْ ۚ أَفَلَا تَعْقِلُونَ",
            "ref": "2:76",
            "verseEn": ""
          },
          {
            "ar": "افْتَحْ",
            "en": "Judge (Open the Judgment)",
            "verse": "قَدِ افْتَرَيْنَا عَلَى اللَّهِ كَذِبًا إِنْ عُدْنَا فِي مِلَّتِكُمْ بَعْدَ إِذْ نَجَّانَا اللَّهُ مِنْهَا ۚ وَمَا يَكُونُ لَنَا أَنْ نَعُودَ فِيهَا إِلَّا أَنْ يَشَاءَ اللَّهُ رَبُّنَا ۚ وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْمًا ۚ عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنْتَ خَيْرُ الْفَاتِحِينَ",
            "ref": "7:89",
            "verseEn": ""
          }
        ],
        "verse": {
          "ayah": "مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِهِ ۚ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
          "en": "Whatever Allah grants to people of mercy - none can withhold it; and whatever He withholds - none can release it thereafter. And He is the Exalted in Might, the Wise.",
          "ref": "35:2"
        }
      }
    ]
  },
  "wordle": {
    "word": "صبر",
    "display": "صَبْر",
    "hint": "A virtue emphasized in times of trial, meaning steadfast endurance through difficulty",
    "verse": "Al-Baqarah 2:45 — And seek help through patience and prayer, though it is a hard thing except for the humble",
    "arabicVerse": "وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ"
  },
  "deduction": {
    "title": "The Miracle of Silent Proof",
    "intro": "You encounter a figure shrouded story of divine intervention. A tale of miraculous provision and a speechless defense that echoes through time. Can you uncover who faced this extraordinary trial?",
    "clues": [
      "I received a divine message that left me astonished",
      "My people questioned my purity when I returned with a child",
      "I was commanded to fast from speaking for a period",
      "A spring of water and dates sustained me during my trial",
      "My Lord made a miraculous tree shake to provide for me",
      "An angel appeared to me in the form of a perfect man"
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Maryam",
          "Asiya",
          "Hawa",
          "Sarah",
          "Khadijah"
        ],
        "answer": "Maryam"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "Giving birth alone under a palm tree",
          "Facing a deadly famine",
          "Being thrown into a fiery pit",
          "Fleeing a tyrannical ruler",
          "Guarding a sacred relic"
        ],
        "answer": "Giving birth alone under a palm tree"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "Palm tree",
          "Burning bush",
          "Stone temple",
          "River Nile",
          "Mount Sinai"
        ],
        "answer": "Palm tree"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "My innocence was proven when my infant son spoke",
          "I became a revered queen",
          "My people were destroyed by divine punishment",
          "I led my nation to victory",
          "A miraculous well appeared permanently"
        ],
        "answer": "My innocence was proven when my infant son spoke"
      }
    },
    "verse": "Then he called her from below her, 'Do not grieve; your Lord has provided beneath you a stream. And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.' (Maryam 19:24-25)",
    "arabic": "فَنَادَىٰهَا مِن تَحْتِهَا أَلَّا تَحْزَنِي قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا ﴿٢٤﴾ وَهُزِّي إِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسَاقِطْ عَلَيْكِ رُطَبًا جَنِيًّا ﴿٢٥﴾"
  },
  "scramble": {
    "reference": "Surah Al-Mulk (67:2)",
    "words": [
      "الَّذِي خَلَقَ",
      "الْمَوْتَ وَالْحَيَاةَ",
      "لِيَبْلُوَكُمْ أَيُّكُمْ",
      "أَحْسَنُ عَمَلًا",
      "وَهُوَ الْعَزِيزُ الْغَفُورُ"
    ],
    "translations": [
      "Who created",
      "death and life",
      "to test which of you",
      "is best in deed",
      "And He is the Exalted in Might, the Forgiving"
    ],
    "arabic": "الَّذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا وَهُوَ الْعَزِيزُ الْغَفُورُ",
    "hint": "Discusses the purpose of creation and Allah's attributes of Might and Forgiveness"
  }
}