{
  "connections": {
    "categories": [
      {
        "name": "خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ",
        "nameEn": "Creation of the Heavens and Earth",
        "color": "yellow",
        "items": [
          {
            "ar": "أَرْضَ",
            "en": "earth",
            "ref": "7:54",
            "verse": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ فِى سِتَّةِ أَيَّامٍۢ ثُمَّ ٱسْتَوَىٰ عَلَى ٱلْعَرْشِ يُغْشِى ٱلَّيْلَ ٱلنَّهَارَ يَطْلُبُهُۥ حَثِيثًۭا وَٱلشَّمْسَ وَٱلْقَمَرَ وَٱلنُّجُومَ مُسَخَّرَٰتٍۭ بِأَمْرِهِۦٓ ۗ أَلَا لَهُ ٱلْخَلْقُ وَٱلْأَمْرُ ۗ تَبَارَكَ ٱللَّهُ رَبُّ ٱلْعَـٰلَمِينَ",
            "verseEn": "Indeed, your Lord is Allāh, who created the heavens and earth in six days and then established Himself above the Throne. He covers the night with the day, [another night] chasing it rapidly; and [He created] the sun, the moon, and the stars, subjected by His command. Unquestionably, His is the creation and the command; blessed is Allāh, Lord of the worlds."
          },
          {
            "ar": "سَمَاءَ",
            "en": "sky",
            "ref": "50:6",
            "verse": "أَفَلَمْ يَنظُرُوٓا۟ إِلَى ٱلسَّمَآءِ فَوْقَهُمْ كَيْفَ بَنَيْنَـٰهَا وَزَيَّنَّـٰهَا وَمَا لَهَا مِن فُرُوجٍۢ",
            "verseEn": "Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?"
          },
          {
            "ar": "جِبَالًا",
            "en": "mountains",
            "ref": "78:7",
            "verse": "وَٱلْجِبَالَ أَوْتَادًۭا",
            "verseEn": "And the mountains as stakes?"
          },
          {
            "ar": "بَحْرَ",
            "en": "sea",
            "ref": "2:164",
            "verse": "إِنَّ فِى خَلْقِ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ وَٱخْتِلَـٰفِ ٱلَّيْلِ وَٱلنَّهَارِ وَٱلْفُلْكِ ٱلَّتِى تَجْرِى فِى ٱلْبَحْرِ بِمَا يَنفَعُ ٱلنَّاسَ وَمَآ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَآءِ مِن مَّآءٍۢ فَأَحْيَا بِهِ ٱلْأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَآبَّةٍۢ وَتَصْرِيفِ ٱلرِّيَـٰحِ وَٱلسَّحَابِ ٱلْمُسَخَّرِ بَيْنَ ٱلسَّمَآءِ وَٱلْأَرْضِ لَـَٔايَـٰتٍۢ لِّقَوْمٍۢ يَعْقِلُونَ",
            "verseEn": "Indeed, in the creation of the heavens and the earth, and the alternation of the night and the day, and the [great] ships which sail through the sea with that which benefits people, and what Allāh has sent down from the heavens of rain, giving life thereby to the earth after its lifelessness and dispersing therein every [kind of] moving creature, and [His] directing of the winds and the clouds controlled between the heaven and earth are signs for a people who use reason."
          }
        ],
        "verse": {
          "ref": "6:1",
          "en": "[All] praise is [due] to Allāh, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.",
          "ayah": "ٱلْحَمْدُ لِلَّهِ ٱلَّذِى خَلَقَ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ وَجَعَلَ ٱلظُّلُمَـٰتِ وَٱلنُّورَ ۖ ثُمَّ ٱلَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ يَعْدِلُونَ"
        }
      },
      {
        "name": "صِفَاتُ الْمُؤْمِنِينَ",
        "nameEn": "Qualities of the Believers",
        "color": "green",
        "items": [
          {
            "ar": "مُتَّقِينَ",
            "en": "pious ones",
            "ref": "3:133",
            "verse": "۞ وَسَارِعُوٓا۟ إِلَىٰ مَغْفِرَةٍۢ مِّن رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا ٱلسَّمَـٰوَٰتُ وَٱلْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ",
            "verseEn": "And hasten to forgiveness from your Lord and a garden [i.e., Paradise] as wide as the heavens and earth, prepared for the righteous"
          },
          {
            "ar": "صَابِرِينَ",
            "en": "patient ones",
            "ref": "2:177",
            "verse": "۞ لَّيْسَ ٱلْبِرَّ أَن تُوَلُّوا۟ وُجُوهَكُمْ قِبَلَ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ وَلَـٰكِنَّ ٱلْبِرَّ مَنْ ءَامَنَ بِٱللَّهِ وَٱلْيَوْمِ ٱلْـَٔاخِرِ وَٱلْمَلَـٰٓئِكَةِ وَٱلْكِتَـٰبِ وَٱلنَّبِيِّـۧنَ وَءَاتَى ٱلْمَالَ عَلَىٰ حُبِّهِۦ ذَوِى ٱلْقُرْبَىٰ وَٱلْيَتَـٰمَىٰ وَٱلْمَسَـٰكِينَ وَٱبْنَ ٱلسَّبِيلِ وَٱلسَّآئِلِينَ وَفِى ٱلرِّقَابِ وَأَقَامَ ٱلصَّلَوٰةَ وَءَاتَى ٱلزَّكَوٰةَ وَٱلْمُوفُونَ بِعَهْدِهِمْ إِذَا عَـٰهَدُوا۟ ۖ وَٱلصَّـٰبِرِينَ فِى ٱلْبَأْسَآءِ وَٱلضَّرَّآءِ وَحِينَ ٱلْبَأْسِ ۗ أُو۟لَـٰٓئِكَ ٱلَّذِينَ صَدَقُوا۟ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُتَّقُونَ",
            "verseEn": "Righteousness is not that you turn your faces toward the east or the west, but [true] righteousness is [in] one who believes in Allāh, the Last Day, the angels, the Book, and the prophets and gives wealth, in spite of love for it, to relatives, orphans, the needy, the traveler, those who ask [for help], and for freeing slaves; [and who] establishes prayer and gives zakāh; [those who] fulfill their promise when they promise; and [those who] are patient in poverty and hardship and during battle. Those are the ones who have been true, and it is those who are the righteous."
          },
          {
            "ar": "مُؤْمِنُونَ",
            "en": "believers",
            "ref": "8:2",
            "verse": "إِنَّمَا ٱلْمُؤْمِنُونَ ٱلَّذِينَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ ءَايَـٰتُهُۥ زَادَتْهُمْ إِيمَـٰنًۭا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
            "verseEn": "The believers are only those who, when Allāh is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -"
          },
          {
            "ar": "شَاكِرًا",
            "en": "grateful",
            "ref": "16:121",
            "verse": "شَاكِرًۭا لِّأَنْعُمِهِ ۚ ٱجْتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
            "verseEn": "[He was] grateful for His favors. He [i.e., Allāh] chose him and guided him to a straight path."
          }
        ],
        "verse": {
          "ref": "23:1",
          "en": "Certainly will the believers have succeeded:",
          "ayah": "قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ"
        }
      },
      {
        "name": "أَمْثَالٌ وَتَشْبِيهَاتٌ قُرْآنِيَّةٌ",
        "nameEn": "Quranic Parables and Similes",
        "color": "blue",
        "items": [
          {
            "ar": "مَثَلُ",
            "en": "likeness/parable",
            "ref": "2:261",
            "verse": "مَّثَلُ ٱلَّذِينَ يُنفِقُونَ أَمْوَٰلَهُمْ فِى سَبِيلِ ٱللَّهِ كَمَثَلِ حَبَّةٍ أَنۢبَتَتْ سَبْعَ سَنَابِلَ فِى كُلِّ سُنۢبُلَةٍۢ مِّا۟ئَةُ حَبَّةٍۢ ۗ وَٱللَّهُ يُضَـٰعِفُ لِمَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
            "verseEn": "The example of those who spend their wealth in the way of Allāh is like a seed [of grain] which grows seven spikes; in each spike is a hundred grains. And Allāh multiplies [His reward] for whom He wills. And Allāh is all-Encompassing and Knowing."
          },
          {
            "ar": "ظُلُمَاتِ",
            "en": "darknesses",
            "ref": "5:16",
            "verse": "يَهْدِى بِهِ ٱللَّهُ مَنِ ٱتَّبَعَ رِضْوَٰنَهُۥ سُبُلَ ٱلسَّلَـٰمِ وَيُخْرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ بِإِذْنِهِۦ وَيَهْدِيهِمْ إِلَىٰ صِرَٰطٍۢ مُّسْتَقِيمٍۢ",
            "verseEn": "By which Allāh guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path."
          },
          {
            "ar": "نُورًا",
            "en": "light",
            "ref": "6:122",
            "verse": "أَوَمَن كَانَ مَيْتًۭا فَأَحْيَيْنَـٰهُ وَجَعَلْنَا لَهُۥ نُورًۭا يَمْشِى بِهِۦ فِى ٱلنَّاسِ كَمَن مَّثَلُهُۥ فِى ٱلظُّلُمَـٰتِ لَيْسَ بِخَارِجٍۢ مِّنْهَا ۚ كَذَٰلِكَ زُيِّنَ لِلْكَـٰفِرِينَ مَا كَانُوا۟ يَعْمَلُونَ",
            "verseEn": "And is one who was dead and We gave him life and made for him light by which to walk among the people like one who is in darkness, never to emerge therefrom? Thus it has been made pleasing to the disbelievers that which they were doing."
          },
          {
            "ar": "الْعَنْكَبُوتِ",
            "en": "the spider",
            "ref": "29:41",
            "verse": "مَثَلُ ٱلَّذِينَ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ أَوْلِيَآءَ كَمَثَلِ ٱلْعَنكَبُوتِ ٱتَّخَذَتْ بَيْتًۭا ۖ وَإِنَّ أَوْهَنَ ٱلْبُيُوتِ لَبَيْتُ ٱلْعَنكَبُوتِ ۖ لَوْ كَانُوا۟ يَعْلَمُونَ",
            "verseEn": "The example of those who take allies other than Allāh is like that of the spider who takes [i.e., constructs] a home. And indeed, the weakest of homes is the home of the spider, if they only knew."
          }
        ],
        "verse": {
          "ref": "2:17",
          "en": "Their example is that of one who kindled a fire, but when it illuminated what was around him, Allāh took away their light and left them in darkness [so] they could not see.",
          "ayah": "مَثَلُهُمْ كَمَثَلِ ٱلَّذِى ٱسْتَوْقَدَ نَارًۭا فَلَمَّآ أَضَآءَتْ مَا حَوْلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِى ظُلُمَـٰتٍۢ لَّا يُبْصِرُونَ"
        }
      },
      {
        "name": "مَصْطَلَحَاتُ الْوَزْنِ وَالْكَيْلِ",
        "nameEn": "Terms of Weight and Measure",
        "color": "purple",
        "items": [
          {
            "ar": "الْمِيزَانَ",
            "en": "the balance/scale",
            "ref": "57:25",
            "verse": "لَقَدْ أَرْسَلْنَا رُسُلَنَا بِٱلْبَيِّنَـٰتِ وَأَنزَلْنَا مَعَهُمُ ٱلْكِتَـٰبَ وَٱلْمِيزَانَ لِيَقُومَ ٱلنَّاسُ بِٱلْقِسْطِ ۖ وَأَنزَلْنَا ٱلْحَدِيدَ فِيهِ بَأْسٌۭ شَدِيدٌۭ وَمَنَـٰفِعُ لِلنَّاسِ وَلِيَعْلَمَ ٱللَّهُ مَن يَنصُرُهُۥ وَرُسُلَهُۥ بِٱلْغَيْبِ ۚ إِنَّ ٱللَّهَ قَوِىٌّ عَزِيزٌۭ",
            "verseEn": "We have already sent Our messengers with clear evidences and sent down with them the Scripture and the balance that the people may maintain [their affairs] in justice. And We sent down iron, wherein is great military might and benefits for the people, and so that Allāh may make evident those who support Him and His messengers unseen. Indeed, Allāh is Powerful and Exalted in Might."
          },
          {
            "ar": "مَوَازِينُهُ",
            "en": "his scales",
            "ref": "101:6",
            "verse": "فَأَمَّا مَن ثَقُلَتْ مَوَٰزِينُهُۥ",
            "verseEn": "Then as for one whose scales are heavy [with good deeds],"
          },
          {
            "ar": "الْكَيْلَ",
            "en": "the measure",
            "ref": "12:59",
            "verse": "وَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ قَالَ ٱئْتُونِى بِأَخٍۢ لَّكُم مِّنْ أَبِيكُمْ ۚ أَلَا تَرَوْنَ أَنِّىٓ أُوفِى ٱلْكَيْلَ وَأَنَا۠ خَيْرُ ٱلْمُنزِلِينَ",
            "verseEn": "And when he had furnished them with their supplies, he said, \"Bring me a brother of yours from your father. Do you not see that I give full measure and that I am the best of accommodators?"
          },
          {
            "ar": "مِثْقَالَ",
            "en": "weight of/atom's weight",
            "ref": "99:7",
            "verse": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًۭا يَرَهُۥ",
            "verseEn": "So whoever does an atom's weight of good will see it,"
          }
        ],
        "verse": {
          "ref": "7:85",
          "en": "And to [the people of] Madyan [We sent] their brother Shuʿayb. He said, \"O my people, worship Allāh; you have no deity other than Him. There has come to you clear evidence from your Lord. So fulfill the measure and weight and do not deprive people of their due and cause not corruption upon the earth after its reformation. That is better for you, if you should be believers.",
          "ayah": "وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًۭا ۗ قَالَ يَـٰقَوْمِ ٱعْبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنْ إِلَـٰهٍ غَيْرُهُۥ ۖ قَدْ جَآءَتْكُم بَيِّنَةٌۭ مِّن رَّبِّكُمْ ۖ فَأَوْفُوا۟ ٱلْكَيْلَ وَٱلْمِيزَانَ وَلَا تَبْخَسُوا۟ ٱلنَّاسَ أَشْيَآءَهُمْ وَلَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ بَعْدَ إِصْلَـٰحِهَا ۚ ذَٰلِكُمْ خَيْرٌۭ لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ"
        }
      }
    ]
  },
  "wordle": {
    "word": "امر",
    "display": "أَمْر",
    "hint": "It can be a divine directive or a general concern.",
    "verseRef": "2:210",
    "arabicVerse": "هَلْ يَنظُرُونَ إِلَّآ أَن يَأْتِيَهُمُ ٱللَّهُ فِى ظُلَلٍۢ مِّنَ ٱلْغَمَامِ وَٱلْمَلَـٰٓئِكَةُ وَقُضِىَ ٱلْأَمْرُ ۚ وَإِلَى ٱللَّهِ تُرْجَعُ ٱلْأُمُورُ",
    "verse": "2:210 — Do they await but that Allāh should come to them in covers of clouds and the angels [as well] and the matter is [then] decided? And to Allāh [all] matters are returned."
  },
  "deduction": {
    "title": "The Builder of Barriers",
    "intro": "Across vast lands, a powerful individual embarked on a series of expeditions, granted immense authority and means. This soul encountered diverse communities and faced unique challenges, leaving a lasting mark on history and faith through their actions and wisdom, all while acknowledging the true source of their strength.",
    "clues": [
      "I was granted power and means over everything, and I followed a way.",
      "My journey took me to the setting place of the sun, where I found a people.",
      "I encountered a community who could barely understand speech, residing between two mountains.",
      "I was asked to build a barrier, not for personal gain, but to protect against a destructive force.",
      "I declared that the strength to build this massive wall came from Allah, and it would stand until a promised time.",
      "My name, often translated as 'The Two-Horned One,' signifies my reach across the earth or perhaps two distinct eras."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Prophet Musa",
          "Prophet Sulayman",
          "Dhul-Qarnayn",
          "Pharaoh",
          "Luqman"
        ],
        "answer": "Dhul-Qarnayn"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "Receiving revelation",
          "Facing a tyrant",
          "Building a great ship",
          "Constructing a mighty barrier",
          "Being swallowed by a fish"
        ],
        "answer": "Constructing a mighty barrier"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Iron Barrier",
          "The River Nile",
          "The Throne"
        ],
        "answer": "The Iron Barrier"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Salvation from flood",
          "Becoming a great kingdom",
          "Protection for a people",
          "Destruction of an oppressor",
          "Enduring wisdom"
        ],
        "answer": "Protection for a people"
      }
    },
    "verseRef": "18:95",
    "arabic": "قَالَ مَا مَكَّنِّى فِيهِ رَبِّى خَيْرٌۭ فَأَعِينُونِى بِقُوَّةٍ أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا",
    "verse": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength [i.e., manpower]; I will make between you and them a dam. (18:95)"
  },
  "scramble": {
    "verseRef": "3:139",
    "reference": "Surah Al-Imran (3:139)",
    "segments": [
      "وَلَا تَهِنُوا",
      "وَلَا تَحْزَنُوا",
      "وَأَنتُمُ الْأَعْلَوْنَ",
      "إِن كُنتُم مُّؤْمِنِينَ"
    ],
    "translations": [
      "And (do) not weaken and (do) not",
      "grieve and you (will be)",
      "[the] superior if",
      "you are believers"
    ],
    "hint": "This verse offers encouragement to believers, reminding them of their elevated status and urging them not to despair in the face of challenges.",
    "arabic": "وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ",
    "words": [
      "وَلَا تَهِنُوا۟ وَلَا",
      "تَحْزَنُوا۟ وَأَنتُمُ",
      "ٱلْأَعْلَوْنَ إِن",
      "كُنتُم مُّؤْمِنِينَ"
    ],
    "verseEn": "So do not weaken and do not grieve, and you will be superior if you are [true] believers."
  }
}