{
  "date": "2026-02-17",
  "puzzle": {
    "title": "The Seed of Strife",
    "intro": "Before the world knew widespread conflict, a profound test of faith and obedience unfolded. This narrative explores the choices made by an individual, whose actions set a precedent for future generations. Prepare to unravel the tale of a soul grappling with immense jealousy and its devastating consequences.",
    "clues": [
      "I was among the first offspring to walk the earth, a child of the very first human pair.",
      "My brother and I were commanded to offer a sacrifice to Allah, a test of our sincerity.",
      "My offering was not accepted, while my brother's was, which filled my heart with a terrible emotion.",
      "I spoke words of threat to my brother, driven by the bitterness of rejection.",
      "My brother responded with wisdom and piety, reminding me of Allah's justice and the fear of Him.",
      "Despite my brother's gentle words and his willingness to forgive, I took a life, becoming one of the losers."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Prophet Adam",
          "Iblis",
          "Prophet Nuh",
          "Qabil (Cain)",
          "Fir'awn"
        ],
        "answer": "Qabil (Cain)"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The great flood",
          "The splitting of the sea",
          "The building of the Kaaba",
          "The offering of sacrifices",
          "The temptation in the Garden"
        ],
        "answer": "The offering of sacrifices"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Mountain of Safa",
          "The Sacrifice",
          "The Burning Bush"
        ],
        "answer": "The Sacrifice"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Became a messenger",
          "Was drowned",
          "Built a great kingdom",
          "Became an example of regret",
          "Was granted immense wealth"
        ],
        "answer": "Became an example of regret"
      }
    },
    "verseRef": "5:30",
    "arabic": "فَطَوَّعَتْ لَهُۥ نَفْسُهُۥ قَتْلَ أَخِيهِ فَقَتَلَهُۥ فَأَصْبَحَ مِنَ ٱلْخَـٰسِرِينَ",
    "verse": "And his soul permitted to him the murder of his brother, so he killed him and became among the losers. (5:30)"
  },
  "generated": true
}