{
  "date": "2026-02-21",
  "puzzle": {
    "title": "The Herald of the Great Deluge",
    "intro": "This individual stood as a pillar of endurance for centuries, calling a defiant society toward the light of truth while facing mockery and rejection. Despite the overwhelming odds and the weight of a message spanning generations, this servant remained steadfast in their mission until the final decree was issued.",
    "clues": [
      "I spent nine hundred and fifty years calling my people to the path of righteousness, day and night, in secret and in public.",
      "I warned my people of a painful punishment, yet they put their fingers in their ears and covered themselves with their garments in arrogance.",
      "I was commanded to build something massive under the watchful eyes of my Lord, even though there was no water in sight.",
      "As I worked, the leaders of my people passed by and mocked me, but I told them that soon we would be the ones mocking them.",
      "I pleaded for my own flesh and blood to join me, but they chose to seek refuge on a mountain, believing it would save them from the rising tide.",
      "My vessel eventually came to rest on Mount Judi after the earth swallowed its water and the sky ceased its downpour."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "Prophet Hud",
          "Prophet Salih",
          "Prophet Nuh",
          "Prophet Lut",
          "Prophet Shu'ayb"
        ],
        "answer": "Prophet Nuh"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The Transforming Staff",
          "The Great Flood",
          "The Cooling Fire",
          "The Splitting Sea",
          "The Camel of God"
        ],
        "answer": "The Great Flood"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Golden Calf",
          "The Staff",
          "The Shirt",
          "The Ark",
          "The Ring"
        ],
        "answer": "The Ark"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Entering the Promised Land",
          "Drowning in the Red Sea",
          "Resting on Mount Judi",
          "Being thrown into a pit",
          "Ascending to the Heavens"
        ],
        "answer": "Resting on Mount Judi"
      }
    },
    "verseRef": "11:44",
    "arabic": "وَقِيلَ يَـٰٓأَرْضُ ٱبْلَعِى مَآءَكِ وَيَـٰسَمَآءُ أَقْلِعِى وَغِيضَ ٱلْمَآءُ وَقُضِىَ ٱلْأَمْرُ وَٱسْتَوَتْ عَلَى ٱلْجُودِىِّ ۖ وَقِيلَ بُعْدًۭا لِّلْقَوْمِ ٱلظَّـٰلِمِينَ",
    "verse": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and it [i.e., the ship] came to rest on the [mountain of] Jūdiyy. And it was said, \"Away with the wrongdoing people.\" (11:44)"
  },
  "generated": true
}