{
  "date": "2026-02-19",
  "puzzle": {
    "date": "2026-02-19",
    "juz_number": 3,
    "juz_name": "Tilka ar-Rusul",
    "juz_name_ar": "تِلْكَ الرُّسُلُ",
    "verse": {
      "surah_number": 2,
      "surah_name": "Al-Baqarah",
      "surah_name_ar": "الْبَقَرَة",
      "ayah_number": 255,
      "arabic_text": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌۭ وَلَا نَوْمٌۭ ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
      "translation": "Allāh - there is no deity except Him, the Ever-Living, the Self-Sustaining. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursī extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
      "audio_url": "https://cdn.islamic.network/quran/audio/128/ar.alafasy/262.mp3"
    },
    "theme_question": {
      "correct": "The absolute sovereignty and self-subsistence of Allah (Ayat al-Kursi)",
      "options": [
        "The story of Prophet Ibrahim and the fire",
        "The absolute sovereignty and self-subsistence of Allah (Ayat al-Kursi)",
        "The rules of divorce and family life",
        "The description of the Day of Judgment"
      ]
    },
    "surah_question": {
      "correct_surah": 2,
      "options": [
        {
          "num": 3,
          "name": "Al Imran",
          "name_ar": "آل عِمْرَان",
          "name_en": "The Family of Imran"
        },
        {
          "num": 2,
          "name": "Al-Baqarah",
          "name_ar": "الْبَقَرَة",
          "name_en": "The Cow"
        },
        {
          "num": 4,
          "name": "An-Nisa",
          "name_ar": "النِّسَاء",
          "name_en": "The Women"
        },
        {
          "num": 5,
          "name": "Al-Ma'idah",
          "name_ar": "الْمَائِدَة",
          "name_en": "The Table Spread"
        }
      ]
    },
    "surah_order": {
      "surahs": [
        {
          "num": 2,
          "name": "Al-Baqarah",
          "name_ar": "الْبَقَرَة",
          "name_en": "The Cow"
        },
        {
          "num": 3,
          "name": "Al Imran",
          "name_ar": "آل عِمْرَان",
          "name_en": "The Family of Imran"
        }
      ]
    },
    "educational_notes": {
      "verse_context": "Ayat al-Kursi (The Verse of the Throne) is the 255th verse of Surah Al-Baqarah. It is considered the greatest verse in the Quran and is recited for protection. It describes Allah's absolute authority over the heavens and the earth and His attribute of being Ever-Living and Sustainer of existence.",
      "theme_explanation": "This verse establishes the concept of Tawhid (Oneness of God) in the most comprehensive manner. It negates any weakness, sleep, or fatigue from Allah and affirms His infinite knowledge and power. The 'Kursi' (Footstool/Chair) represents His dominion and authority which extends over the entire universe.",
      "surah_overview": "Surah Al-Baqarah is the longest surah in the Quran. It covers meaningful laws, stories of past prophets (like Adam, Ibrahim, and Musa), and guidance for the Muslim community. It was revealed in Madinah and contains the longest verse (2:282) and the greatest verse (2:255)."
    }
  },
  "generated": true,
  "model": "auto (chain)"
}