{
  "date": "2026-02-19",
  "puzzle": {
    "title": "The Folly of Grand Ambition",
    "intro": "Embark on a journey to uncover the identity of a collective entity whose audacious plans met an unexpected, powerful end. This narrative serves as a profound reminder of divine might and the fragility of worldly power when it opposes the sacred. Unravel the mystery of this group, whose story is etched in the Quran as a warning for all who seek to transgress.",
    "clues": [
      "We harbored a grand ambition, believing our might was unmatched, and set forth on a journey with a clear, destructive objective.",
      "Our leader, filled with arrogance, sought to defile a sacred House revered by many, aiming to divert pilgrimage to a structure built by us.",
      "From a distant land, we marched with a massive force, confident in our ability to dismantle the ancient edifice in the Holy City.",
      "Our army was formidable, spearheaded by magnificent creatures, a sight rarely, if ever, witnessed in such a campaign by the inhabitants of the land we invaded.",
      "When we reached our destination, a divine intervention occurred; small, winged creatures appeared, pelting us with stones of baked clay.",
      "Our entire expedition met a devastating end, leaving our formidable force utterly annihilated, like chewed-up straw, our grand plan reduced to dust."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "People of Thamud",
          "People of 'Ad",
          "People of Sodom",
          "People of the Elephant",
          "People of the Garden"
        ],
        "answer": "People of the Elephant"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The Great Flood",
          "The Campaign against the Kaaba",
          "The Destruction of the Idols",
          "The Splitting of the Sea",
          "The Earthquake of Midian"
        ],
        "answer": "The Campaign against the Kaaba"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Kaaba",
          "The Golden Calf",
          "The Fire"
        ],
        "answer": "The Kaaba"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Divine salvation",
          "A long period of prosperity",
          "Conversion to Islam",
          "Utter destruction",
          "Exile from their land"
        ],
        "answer": "Utter destruction"
      }
    },
    "verseRef": "105:1",
    "arabic": "أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَـٰبِ ٱلْفِيلِ",
    "verse": "Have you not considered, [O Muḥammad], how your Lord dealt with the companions of the elephant? (105:1)"
  },
  "generated": true,
  "model": "auto (chain)"
}