{
  "date": "2026-02-18",
  "puzzle": {
    "title": "The Steadfast Witness",
    "intro": "A profound narrative unfolds, revealing the unwavering resolve of a community in the face of immense tyranny. Their story serves as a testament to faith, even when confronted with the ultimate sacrifice. This account reminds us of the power of belief against overwhelming oppression.",
    "clues": [
      "We were a group whose story is recounted in a short, powerful surah, warning against persecution.",
      "We faced a ruler who wished to eradicate our belief in the One God, the Lord of the Throne, the Praiseworthy.",
      "We were subjected to a terrible test involving a massive pit dug into the earth.",
      "We watched as believers, including infants, were cast into a raging inferno within that pit.",
      "Our tormentors were cursed for their actions, while we were promised immense reward for our steadfastness.",
      "The ruler's attempt to extinguish our faith only solidified our place as martyrs in the sight of Allah, who is witness to all things."
    ],
    "categories": {
      "identity": {
        "label": "Who Am I?",
        "options": [
          "People of Thamud",
          "People of 'Ad",
          "People of the Ditch",
          "People of Lut",
          "People of the Elephant"
        ],
        "answer": "People of the Ditch"
      },
      "trial": {
        "label": "Trial/Event",
        "options": [
          "The Great Flood",
          "The Burning Bush",
          "The Drowning in the Sea",
          "The Fiery Pit",
          "The Earthquake"
        ],
        "answer": "The Fiery Pit"
      },
      "location": {
        "label": "Key Element",
        "options": [
          "The Ark",
          "The Staff",
          "The Ditch",
          "The Mountain",
          "The Well"
        ],
        "answer": "The Ditch"
      },
      "outcome": {
        "label": "Outcome",
        "options": [
          "Were granted a kingdom",
          "Were saved by a miracle",
          "Achieved martyrdom and Paradise",
          "Were scattered across lands",
          "Were given immense wealth"
        ],
        "answer": "Achieved martyrdom and Paradise"
      }
    },
    "verseRef": "85:8",
    "arabic": "وَمَا نَقَمُوا۟ مِنْهُمْ إِلَّآ أَن يُؤْمِنُوا۟ بِٱللَّهِ ٱلْعَزِيزِ ٱلْحَمِيدِ",
    "verse": "And they resented them not except because they believed in Allāh, the Exalted in Might, the Praiseworthy, (85:8)"
  },
  "generated": true
}