{
  "date": "2026-02-20",
  "puzzle": {
    "categories": [
      {
        "name": "سِجِلُّ الأَعْمَالِ",
        "nameEn": "Record of Deeds",
        "color": "yellow",
        "items": [
          {
            "ar": "كِتَابَهُ",
            "en": "his record",
            "ref": "84:7",
            "verse": "فَأَمَّا مَنْ أُوتِىَ كِتَـٰبَهُۥ بِيَمِينِهِۦ",
            "verseEn": "Then as for he who is given his record in his right hand,"
          },
          {
            "ar": "صُحُفُ",
            "en": "scrolls",
            "ref": "81:10",
            "verse": "وَإِذَا ٱلصُّحُفُ نُشِرَتْ",
            "verseEn": "And when the pages are spread [i.e., made public]"
          },
          {
            "ar": "الْمَوَازِينَ",
            "en": "the scales",
            "ref": "21:47",
            "verse": "وَنَضَعُ ٱلْمَوَٰزِينَ ٱلْقِسْطَ لِيَوْمِ ٱلْقِيَـٰمَةِ فَلَا تُظْلَمُ نَفْسٌۭ شَيْـًۭٔا ۖ وَإِن كَانَ مِثْقَالَ حَبَّةٍۢ مِّنْ خَرْدَلٍ أَتَيْنَا بِهَا ۗ وَكَفَىٰ بِنَا حَـٰسِبِينَ",
            "verseEn": "And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant."
          },
          {
            "ar": "الْأَلْوَاحِ",
            "en": "the tablets",
            "ref": "7:145",
            "verse": "وَكَتَبْنَا لَهُۥ فِى ٱلْأَلْوَاحِ مِن كُلِّ شَىْءٍۢ مَّوْعِظَةًۭ وَتَفْصِيلًۭا لِّكُلِّ شَىْءٍۢ فَخُذْهَا بِقُوَّةٍۢ وَأْمُرْ قَوْمَكَ يَأْخُذُوا۟ بِأَحْسَنِهَا ۚ سَأُو۟رِيكُمْ دَارَ ٱلْفَـٰسِقِينَ",
            "verseEn": "And We wrote for him on the tablets [something] of all things - instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\""
          }
        ],
        "verse": {
          "ref": "45:29",
          "en": "This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do.\"",
          "ayah": "هَـٰذَا كِتَـٰبُنَا يَنطِقُ عَلَيْكُم بِٱلْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنسِخُ مَا كُنتُمْ تَعْمَلُونَ"
        }
      },
      {
        "name": "نَبَاتَاتٌ مُنْتَفَعٌ بِهَا",
        "nameEn": "Beneficial Plants",
        "color": "green",
        "items": [
          {
            "ar": "زَرْعًا",
            "en": "crops",
            "ref": "32:27",
            "verse": "أَوَلَمْ يَرَوْا۟ أَنَّا نَسُوقُ ٱلْمَآءَ إِلَى ٱلْأَرْضِ ٱلْجُرُزِ فَنُخْرِجُ بِهِۦ زَرْعًۭا تَأْكُلُ مِنْهُ أَنْعَـٰمُهُمْ وَأَنفُسُهُمْ ۖ أَفَلَا يُبْصِرُونَ",
            "verseEn": "Have they not seen that We drive water [in clouds] to barren land and bring forth thereby crops from which their livestock eat and [they] themselves? Then do they not see?"
          },
          {
            "ar": "قَضْبًا",
            "en": "fodder",
            "ref": "80:28",
            "verse": "وَعِنَبًۭا وَقَضْبًۭا",
            "verseEn": "And grapes and herbage"
          },
          {
            "ar": "الشَّجَرُ",
            "en": "the trees",
            "ref": "22:18",
            "verse": "أَلَمْ تَرَ أَنَّ ٱللَّهَ يَسْجُدُ لَهُۥ مَن فِى ٱلسَّمَـٰوَٰتِ وَمَن فِى ٱلْأَرْضِ وَٱلشَّمْسُ وَٱلْقَمَرُ وَٱلنُّجُومُ وَٱلْجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَآبُّ وَكَثِيرٌۭ مِّنَ ٱلنَّاسِ ۖ وَكَثِيرٌ حَقَّ عَلَيْهِ ٱلْعَذَابُ ۗ وَمَن يُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكْرِمٍ ۚ إِنَّ ٱللَّهَ يَفْعَلُ مَا يَشَآءُ ۩",
            "verseEn": "Do you not see [i.e., know] that to Allāh prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allāh humiliates - for him there is no bestower of honor. Indeed, Allāh does what He wills."
          },
          {
            "ar": "النَّخْلَ",
            "en": "the date palms",
            "ref": "6:141",
            "verse": "۞ وَهُوَ ٱلَّذِىٓ أَنشَأَ جَنَّـٰتٍۢ مَّعْرُوشَـٰتٍۢ وَغَيْرَ مَعْرُوشَـٰتٍۢ وَٱلنَّخْلَ وَٱلزَّرْعَ مُخْتَلِفًا أُكُلُهُۥ وَٱلزَّيْتُونَ وَٱلرُّمَّانَ مُتَشَـٰبِهًۭا وَغَيْرَ مُتَشَـٰبِهٍۢ ۚ كُلُوا۟ مِن ثَمَرِهِۦٓ إِذَآ أَثْمَرَ وَءَاتُوا۟ حَقَّهُۥ يَوْمَ حَصَادِهِۦ ۖ وَلَا تُسْرِفُوٓا۟ ۚ إِنَّهُۥ لَا يُحِبُّ ٱلْمُسْرِفِينَ",
            "verseEn": "And He it is who causes gardens to grow, [both] trellised and untrellised, and palm trees and crops of different [kinds of] food and olives and pomegranates, similar and dissimilar. Eat of [each of] its fruit when it yields and give its due [zakāh] on the day of its harvest. And be not excessive. Indeed, He does not like those who commit excess."
          }
        ],
        "verse": {
          "ref": "20:53",
          "en": "[It is He] who has made for you the earth as a bed [spread out] and inserted therein for you roadways and sent down from the sky, rain and produced thereby categories of various plants.",
          "ayah": "ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ مَهْدًۭا وَسَلَكَ لَكُمْ فِيهَا سُبُلًۭا وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجْنَا بِهِۦٓ أَزْوَٰجًۭا مِّن نَّبَاتٍۢ شَتَّىٰ"
        }
      },
      {
        "name": "أَنْوَاعُ الْاِبْتِلَاءِ",
        "nameEn": "Types of Trials",
        "color": "blue",
        "items": [
          {
            "ar": "فِتْنَةٌ",
            "en": "affliction",
            "ref": "2:193",
            "verse": "وَقَـٰتِلُوهُمْ حَتَّىٰ لَا تَكُونَ فِتْنَةٌۭ وَيَكُونَ ٱلدِّينُ لِلَّهِ ۖ فَإِنِ ٱنتَهَوْا۟ فَلَا عُدْوَٰنَ إِلَّا عَلَى ٱلظَّـٰلِمِينَ",
            "verseEn": "Fight them until there is no [more] fitnah and [until] religion [i.e., worship] is [acknowledged to be] for Allāh. But if they cease, then there is to be no aggression [i.e., assault] except against the oppressors."
          },
          {
            "ar": "بَلَاءٌ",
            "en": "a trial",
            "ref": "2:49",
            "verse": "وَإِذْ نَجَّيْنَـٰكُم مِّنْ ءَالِ فِرْعَوْنَ يَسُومُونَكُمْ سُوٓءَ ٱلْعَذَابِ يُذَبِّحُونَ أَبْنَآءَكُمْ وَيَسْتَحْيُونَ نِسَآءَكُمْ ۚ وَفِى ذَٰلِكُم بَلَآءٌۭ مِّن رَّبِّكُمْ عَظِيمٌۭ",
            "verseEn": "And [recall] when We saved you [i.e., your forefathers] from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord."
          },
          {
            "ar": "بِالسِّنِينَ",
            "en": "with years (of famine)",
            "ref": "7:130",
            "verse": "وَلَقَدْ أَخَذْنَآ ءَالَ فِرْعَوْنَ بِٱلسِّنِينَ وَنَقْصٍۢ مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمْ يَذَّكَّرُونَ",
            "verseEn": "And We certainly seized the people of Pharaoh with years of famine and a deficiency in fruits that perhaps they would be reminded."
          },
          {
            "ar": "الضُّرُّ",
            "en": "the adversity",
            "ref": "10:12",
            "verse": "وَإِذَا مَسَّ ٱلْإِنسَـٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦٓ أَوْ قَاعِدًا أَوْ قَآئِمًۭا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُۥ مَرَّ كَأَن لَّمْ يَدْعُنَآ إِلَىٰ ضُرٍّۢ مَّسَّهُۥ ۚ كَذَٰلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُوا۟ يَعْمَلُونَ",
            "verseEn": "And when affliction touches man, he calls upon Us, whether lying on his side or sitting or standing; but when We remove from him his affliction, he continues [in disobedience] as if he had never called upon Us to [remove] an affliction that touched him. Thus is made pleasing to the transgressors that which they have been doing."
          }
        ],
        "verse": {
          "ref": "2:155",
          "en": "And We will surely test you with something of fear and hunger and a loss of wealth and lives and fruits, but give good tidings to the patient,",
          "ayah": "وَلَنَبْلُوَنَّكُم بِشَىْءٍۢ مِّنَ ٱلْخَوْفِ وَٱلْجُوعِ وَنَقْصٍۢ مِّنَ ٱلْأَمْوَٰلِ وَٱلْأَنفُسِ وَٱلثَّمَرَٰتِ ۗ وَبَشِّرِ ٱلصَّـٰبِرِينَ"
        }
      },
      {
        "name": "قُرْبٌ إِلَهِيٌّ وَوُصُولٌ",
        "nameEn": "Divine Proximity and Connection",
        "color": "purple",
        "items": [
          {
            "ar": "وَلِيُّ",
            "en": "the Protector",
            "ref": "2:257",
            "verse": "ٱللَّهُ وَلِىُّ ٱلَّذِينَ ءَامَنُوا۟ يُخْرِجُهُم مِّنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ ۖ وَٱلَّذِينَ كَفَرُوٓا۟ أَوْلِيَآؤُهُمُ ٱلطَّـٰغُوتُ يُخْرِجُونَهُم مِّنَ ٱلنُّورِ إِلَى ٱلظُّلُمَـٰتِ ۗ أُو۟لَـٰٓئِكَ أَصْحَـٰبُ ٱلنَّارِ ۖ هُمْ فِيهَا خَـٰلِدُونَ",
            "verseEn": "Allāh is the Ally of those who believe. He brings them out from darknesses into the light. And those who disbelieve - their allies are ṭāghūt. They take them out of the light into darknesses. Those are the companions of the Fire; they will abide eternally therein."
          },
          {
            "ar": "قَرِيبٌ",
            "en": "near",
            "ref": "2:186",
            "verse": "وَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ",
            "verseEn": "And when My servants ask you, [O Muḥammad], concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided."
          },
          {
            "ar": "حَفِيًّا",
            "en": "gracious",
            "ref": "19:47",
            "verse": "قَالَ سَلَـٰمٌ عَلَيْكَ ۖ سَأَسْتَغْفِرُ لَكَ رَبِّىٓ ۖ إِنَّهُۥ كَانَ بِى حَفِيًّۭا",
            "verseEn": "[Abraham] said, \"Peace [i.e., safety] will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me."
          },
          {
            "ar": "أَوَّابٍ",
            "en": "oft-returning (to Allah)",
            "ref": "50:32",
            "verse": "هَـٰذَا مَا تُوعَدُونَ لِكُلِّ أَوَّابٍ حَفِيظٍۢ",
            "verseEn": "[It will be said], \"This is what you were promised - for every returner [to Allāh] and keeper [of His covenant]."
          }
        ],
        "verse": {
          "ref": "50:16",
          "en": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein.",
          "ayah": "وَلَقَدْ خَلَقْنَا ٱلْإِنسَـٰنَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِۦ نَفْسُهُۥ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ"
        }
      }
    ]
  },
  "generated": true
}